{
  "backend/main.mo": "Defines the main canister actor with hotel, room, booking, payment, and invite-token data models and storage, plus initialization constants and mutable state. Includes numerous public types used across the backend API.",
  "backend/migration.mo": "Contains type definitions and conversion scaffolding for migrating old hotel, room, booking, and user data structures to updated formats. Provides compatibility types for upgrade logic.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to impacted files, components, and test IDs used for audit and verification. Documents recent room, promo pricing, photo management, and room-editing features.",
  "frontend-file-summaries.txt": "Provides high‑level descriptions of major frontend files, covering routing, hooks, layout, pages, and components with focus on booking, hotel management, and admin workflows.",
  "frontend/index.css": "Tailwind setup defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "A pre‑release regression checklist detailing tests for authentication, role handling, booking flows, hotel management, payments, and activation gating across versions.",
  "frontend/RELEASE_NOTES.md": "Template and detailed notes for multiple releases, covering deploy UI issues, HOTEL DUMMY cleanup, ghost room prevention, and legacy data cleanup.",
  "frontend/src/App.tsx": "Configures React Query, routing, auth/role gates, and the main app shell.",
  "frontend/src/buildInfo.ts": "Exports the frontend build version constant v33.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin table displaying all bookings with loading, error, and detail views.",
  "frontend/src/components/admin/CaffeineDeployUiNotice.tsx": "Informational admin alert about Caffeine deploy UI sometimes missing the Publish URL.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Admin tools for removing legacy room photos and outdated payment methods from specific hotels.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Admin panel listing hotels with controls to toggle activation and update subscription status.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Interface to generate, validate, and list invite tokens tied to hotel principals.",
  "frontend/src/components/admin/PrincipalPurgePanel.tsx": "Form for admins to validate a principal ID and permanently purge all associated hotel data.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with role details and optional hotel activation flow.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Error screen shown when permission checks fail, with retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form for hotels to validate and consume invite tokens to activate their accounts.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Prompts authenticated users without a profile to enter basic info before accessing children; handles form validation and profile creation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and forces login via Internet Identity, showing loading and login prompts when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role, admin status, and optional hotel activation to gate access, showing loading, error, or denial screens accordingly.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays a modal with detailed booking information and optional guest principal copying.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking with validation, price calculation, and success feedback.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Shows a badge with the booking status and matched visual variant.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Lists user bookings with status, details, and cancellation flow, handling loading and error states.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Dialog for viewing an image at large size with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays authentication diagnostics including principal ID, role, admin status, and hotel activation using various query hooks.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Fetches and manages hotel bookings with actions for confirming or canceling bookings and displays states for loading, errors, or empty results.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Shows and updates a hotel’s payment methods, allowing adding or removing methods with backend updates and refetching.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Loads and edits a hotel’s profile information with form fields and submits updates to the backend.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Static panel indicating that stay recording is unavailable until backend support is implemented.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with validation and optional editing features including replacement and deletion of images.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creating, editing, deleting hotel rooms with image uploads, form validation, and pricing logic.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription status with badges and messages, and shows admin contact card when inactive.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with top navigation, content area, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a language dropdown allowing users to switch the UI locale (currently only English).",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar showing links and account actions based on authentication, admin status, and hotel activation.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact info and payment methods for hotel activation or subscription scenarios.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Shows a hotel's payment methods and provides quick WhatsApp and email contact buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling auth client creation, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data tied to the authenticated user’s role, profile, and hotel-related status.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements a hook for uploading images by converting them to data URLs with progress tracking.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a locale context with persistence in localStorage and a hook for accessing and updating the current locale.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light/dark themes and UI color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays the user's account status, roles, hotel access, and invite token actions with various refresh and copy utilities.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard with panels for invites, hotel visibility, bookings, data cleanup, and principal management.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Displays a grid of hotels with representative photos, handles loading states, and allows navigating to hotel details with image preview support.",
  "frontend/src/pages/GuestAccountPage.tsx": "Provides guest account overview with links to bookings, account status, and a bookings table.",
  "frontend/src/pages/HotelAreaPage.tsx": "Renders the hotel management portal with tabs, activation checks, and panels for profile, rooms, payments, bookings, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Shows detailed hotel information, contact data, room listings, and booking form based on selected room.",
  "frontend/src/pages/MainMenuPage.tsx": "Landing menu directing users to guest or hotel portals, adapting options based on authentication and hotel activation status.",
  "frontend/src/pages/MyBookingsPage.tsx": "Displays user bookings with navigation shortcuts to hotel browsing and account status pages.",
  "frontend/src/types/extended-backend.ts": "Defines TypeScript interfaces and enums for bookings, hotels, rooms, payments, and user profiles matching backend data.",
  "frontend/src/utils/debugFlags.ts": "Utility enabling debug mode based on environment or URL query parameter.",
  "frontend/src/utils/money.ts": "Provides currency formatting utilities, symbols, names, and validation for supported currencies.",
  "frontend/src/utils/roomPictures.ts": "Provides validation and filtering utilities for room picture URLs and tracks failed image loads.",
  "frontend/src/utils/roomPricing.ts": "Implements bigint‑safe promo validation, discounted price calculation, and promo display formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and layout settings with plugins.",
  "project_state.json": "JSON describing project state, required features, architectural notes, and pending enhancement requests."
}