{
  "backend/main.mo": "Defines core actor with hotel, room, booking, payment, user profile, invite token, and access-control types and maps, including storage and authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Pre-written summaries of all major frontend files, describing routing, components, hooks, styling, and behavior.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme definitions with light/dark variables and base styling.",
  "frontend/index.html": "HTML entry point defining root container, metadata, favicon, and script loading main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Comprehensive regression checklist covering auth flows, role behavior, room management, booking flow, and UI validation.",
  "frontend/src/App.tsx": "Sets up React Query, router configuration, auth/role guards, and overall application shell.",
  "frontend/src/buildInfo.ts": "Exports the current build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin bookings overview panel displaying all bookings in a table with status badges and details dialogs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Admin UI to view hotels, toggle active status, and change subscription state with backend mutations and badges.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Interface for generating and listing invite tokens bound to hotel principals with validation and copy support.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays access‑denied messaging, role requirements, and optionally a hotel activation form with navigation actions.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Error screen for permission checks with retry logic that invalidates role queries and reloads the page.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form for validating and consuming invite tokens to activate a hotel account, showing status and errors.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Gate that forces authenticated users without a saved profile to complete name/email/phone before proceeding.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks access until the user logs in with Internet Identity, showing a login prompt when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards child components by checking user role, admin status, and hotel activation, showing loading, error, or access-denied states.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Provides a dialog displaying detailed booking info with optional guest principal copy functionality.",
  "frontend/src/components/booking/BookingForm.tsx": "Booking form allowing users to enter dates and guests, calculate price, and submit a new booking.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a status badge with variant and label based on booking status.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Displays an image preview in a dialog with a close button and optional title.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Shows real-time authentication, role, admin, and hotel activation diagnostics for debugging.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Lists hotel bookings in a table with details, status badges, and view dialogs.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Allows hotel owners to add or remove payment methods and displays existing ones.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form panel to view and update hotel profile fields with validation and mutation calls.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Displays eligible bookings and allows marking stays as completed via mutation.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Shows room photos with fallback handling and optional compact layout with clickable thumbnails.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages hotel rooms, including listing, creating, editing, and uploading room images.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription and activation status with contextual alerts and payment info.",
  "frontend/src/components/layout/AppShell.tsx": "Provides app layout with top navigation, main content area, and footer including build version.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Simple locale selector allowing switching between available languages.",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar showing links and login/logout actions based on user authentication, role, and hotel profile.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact details and payment methods for hotel activation or subscription scenarios.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Shows a hotel's payment methods and provides buttons to contact the hotel via WhatsApp or email.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, resetting dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and loads stored identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user roles, profiles, admin status, invite tokens, and related mutations using the actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles room image uploads by converting files to data URLs while tracking upload progress.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a simple locale context with persistent storage for switching and accessing the current language.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables for colors, borders, and charts.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays authentication status, user role, hotel activation state, and tools for validating/consuming invite tokens and granting admin access.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard containing invite token management, hotel visibility, and booking administration panels.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and displays a grid of hotels with thumbnails, fallback images, and a preview dialog for browsing available listings.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest booking summaries, navigation to browse hotels or view account status, and a table of the user's reservations.",
  "frontend/src/pages/HotelAreaPage.tsx": "Provides the hotel management interface with tabs for profile, rooms, payments, bookings, stays, and subscriptions, loading the current hotel profile.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays detailed information for a selected hotel including rooms, pricing, photos, and booking form, with loading and not-found handling.",
  "frontend/src/pages/MainMenuPage.tsx": "Renders the main menu with navigation logic for guest and hotel portals, checking authentication, roles, and hotel activation state.",
  "frontend/src/types/extended-backend.ts": "Defines extended TypeScript interfaces and enums mirroring Motoko backend types, including hotels, rooms, bookings, profiles, and admin operations.",
  "frontend/src/utils/debugFlags.ts": "Provides a helper to detect debug mode based on environment or URL parameters.",
  "frontend/src/utils/money.ts": "Contains currency formatting utilities, supported currency definitions, and helpers for displaying money values.",
  "frontend/src/utils/roomPictures.ts": "Provides utilities for validating, filtering, and tracking room picture URLs, including handling failed loads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters via query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, plugins, and theme extensions for the app.",
  "project_state.json": "Describes the regression state and requirements to restore missing role-based panels and fix admin token generation after v26."
}