{
  "backend/main.mo": "Defines primary actor with hotel, room, booking, user, invite, payment types and initializes storage maps, authorization, and migration.",
  "backend/migration.mo": "Provides migration logic converting old actor state from a hotels map to a hotels list while preserving other stored state.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, and root mount target.",
  "frontend/REGRESSION_CHECKLIST.md": "Detailed pre-release testing checklist covering auth, hotel browsing, hotel management, admin features, and guest workflows.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, query client, layout shell, and protected routes.",
  "frontend/src/buildInfo.ts": "Exports build version constant v32.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin panel card showing placeholder message for not-yet-implemented bookings overview.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Provides an admin table to view hotels and toggle their active and subscription status, using mutation hooks and toast notifications.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Allows admins to generate and manage invite tokens bound to hotel principals, with validation and copy-to-clipboard support.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message based on user role and hotel activation status, optionally showing the hotel activation form.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Shows an error screen when permission checks fail and provides retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Validates and consumes invite tokens to activate a hotel account, then refreshes queries and redirects the user.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Blocks access until a newly authenticated user completes a minimal profile form, then saves it via mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects routes by requiring Internet Identity authentication and presents a login screen when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards child components by checking user role, admin status, and optional hotel activation, displaying loading, error, or access‑denied states as needed.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog showing detailed booking information with optional guest principal copying and payment proof indicator.",
  "frontend/src/components/booking/BookingForm.tsx": "Placeholder form informing users that booking functionality is not yet available.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge with variant and label based on a booking status value.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Displays a placeholder card indicating user booking management is not yet implemented.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Dialog for displaying a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Diagnostic panel showing identity, role, admin status, and hotel activation state for debugging auth issues.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Placeholder panel noting that hotel booking management is not yet implemented.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Placeholder panel indicating hotel payment method management is not yet available.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form allowing hotel owners to view and update profile and contact details with validation and save handling.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Placeholder panel stating that guest stay recording functionality is not yet implemented.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with fallback handling for failed images, offering standard or compact gallery layouts with clickable thumbnails.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creating and editing hotel rooms, including form handling, image uploads, and rendering room photo previews.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows hotel subscription status with badges and alerts, and displays admin contact instructions when activation is required.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with top navigation, content container, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a simple language dropdown allowing users to switch the app locale to English.",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar handling authentication, role-based links, and access to admin or hotel areas.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact and payment instructions specifically for hotel activation and subscription management.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and provides buttons to contact the hotel via WhatsApp or email.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout functions, and persists identity using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for calling backend methods related to user roles, profiles, admin actions, and invite tokens.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles converting image files to data URLs with upload progress tracking.",
  "frontend/src/i18n/LocaleContext.tsx": "Stores and provides the current UI locale in React context with localStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root component.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user account state, admin status, hotel access, and invite token validation/consumption tools.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard showing panels for managing invite tokens, hotel visibility, and bookings.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Displays a browsable grid of hotels with representative photos and handles loading, empty states, and image preview.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest account options and provides navigation to bookings, account status, and browsing hotels.",
  "frontend/src/pages/HotelAreaPage.tsx": "Provides a hotel management dashboard with tabs for profile, rooms, payments, bookings, and subscriptions, handling loading and error states.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays detailed hotel info, rooms, photos, and booking form, loading both hotel and room data and handling missing hotels.",
  "frontend/src/pages/MainMenuPage.tsx": "Home portal selection page routing users to guest or hotel portals based on authentication and role.",
  "frontend/src/pages/MyBookingsPage.tsx": "Shows the user's bookings table with shortcuts to browse hotels and view account status.",
  "frontend/src/types/extended-backend.ts": "Defines extended TypeScript interfaces and enums mirroring backend types for hotels, rooms, bookings, payments, and queries.",
  "frontend/src/utils/debugFlags.ts": "Provides a helper to check if debug mode is enabled via dev mode or a URL parameter.",
  "frontend/src/utils/money.ts": "Defines currency metadata and utilities for formatting amounts and validating supported currencies.",
  "frontend/src/utils/roomPictures.ts": "Handles validation, filtering, and selection of room picture URLs and tracks failed image loads.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and container settings.",
  "project_state.json": "Describes current project state, backend regressions, and required fixes for hotel profile and room API functionality."
}