{
  "backend/main.mo": "Defines core hotel booking actor with data types, storage maps, authorization mixins, and initial admin principal setup.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short summaries of key frontend source files for reference or build planning.",
  "frontend/index.css": "Defines global OKLCH-based color variables and Tailwind layers for light/dark theming.",
  "frontend/index.html": "Root HTML document setting metadata, favicon, and loading the main React entrypoint.",
  "frontend/REGRESSION_CHECKLIST.md": "Regression testing checklist covering auth/roles, hotel browsing, hotel management, admin workflows, and guest account functionality.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, auth/role gates, and global providers like QueryClient and LocaleProvider.",
  "frontend/src/buildInfo.ts": "Exports the build version constant used for display and deployment verification.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays all bookings in a table with status, totals, and a details dialog, using a bookings query.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Lists hotels with controls to toggle active status and update subscription type, using related mutation hooks.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Allows admins to generate invite tokens bound to a hotel's principal and view/copy existing tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with role requirements and optionally displays the hotel activation form.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays an error when permission checks fail and provides retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Validates and consumes invite tokens to activate a hotel account with success feedback.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Shows a forced profile setup dialog for authenticated users without a profile and saves basic user info.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps children with an authentication check and prompts Internet Identity login if unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Enforces role-based access control with admin bypass and optional hotel activation checks.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays detailed booking information in a dialog with optional user principal copying and payment proof status.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a room booking, validating dates and guests before submitting a booking request.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing booking status with variant and label mapping.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Shows a table of the user's bookings with status, pricing, and access to the details dialog.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Modal dialog for displaying a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug panel showing authentication state, user role, admin status, and hotel activation with status icons.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays a table of hotel bookings with details, status badges, and booking detail dialogs.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods, allowing adding and removing methods with form inputs and server mutations.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form for viewing and updating hotel profile details including name, location, address, and contact info.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Lists eligible bookings for stay completion and allows marking them as completed.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Renders room photos with fallback handling and supports both compact and full gallery layouts.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "UI for listing, creating, and editing hotel rooms with image uploads and form dialog management.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription and activation status with badges and contextual alerts.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with top navigation, content area, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "A language dropdown allowing the user to switch the app locale, currently only English.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing links based on authentication, role, and hotel profile status with login/logout handling.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Admin contact card for hotel activation/subscription with WhatsApp, email, and payment method details.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and provides contact buttons for WhatsApp or email.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication, auto-refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors to fetch and mutate user roles, profiles, admin actions, and invite tokens.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements a hook to upload or process room images as data URLs with progress tracking.",
  "frontend/src/i18n/LocaleContext.tsx": "Creates a locale context with persistence in localStorage and a hook to access and update the current locale.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme colors and global styling.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders user account status, roles, invite token handling, and admin actions with data fetched via hooks.",
  "frontend/src/pages/AdminPanelPage.tsx": "Displays admin tools including invite token management, hotel visibility, and bookings panels.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Shows a grid of available hotels with image previews, handling loading states and image errors.",
  "frontend/src/pages/GuestAccountPage.tsx": "Guest account dashboard showing booking management and navigation to browsing hotels or viewing account status.",
  "frontend/src/pages/HotelAreaPage.tsx": "Hotel management hub with profile, rooms, payments, bookings, stays, and subscription tabs, with loading and missing-profile handling.",
  "frontend/src/pages/HotelDetailPage.tsx": "Hotel detail view showing hotel info, rooms, photos, payment methods, and booking options with loading and not-found states.",
  "frontend/src/pages/MainMenuPage.tsx": "Main landing menu directing users to guest or hotel portals based on authentication, role, and hotel activation status.",
  "frontend/src/pages/MyBookingsPage.tsx": "Page listing the user's bookings with shortcuts to browse hotels or view account status.",
  "frontend/src/types/extended-backend.ts": "Extended TypeScript interfaces mirroring backend data structures for hotels, rooms, bookings, tokens, and API methods.",
  "frontend/src/utils/debugFlags.ts": "Utility enabling debug mode in development or via a URL parameter.",
  "frontend/src/utils/money.ts": "Currency utilities for formatting amounts and validating supported currencies.",
  "frontend/src/utils/roomPictures.ts": "Helpers for validating, filtering, and tracking room picture URLs for display.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear them from the hash for routing and token handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Defines current project state, known regressions, and required feature restorations related to UI behavior and token generation."
}