{
  "backend/main.mo": "Defines core hotel booking canister types, storage maps, admin principal, and initializes authorization and invite-link state.",
  "feature_evidence.json": "Contains feature evidence metadata linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists concise summaries for all frontend source files used in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point setting up the root element, favicon, meta tags, and script loader.",
  "frontend/REGRESSION_CHECKLIST.md": "Pre-release regression checklist covering auth, booking flows, payments, and UI validations.",
  "frontend/src/App.tsx": "Main React app wiring routes, auth guards, and query client within the application shell.",
  "frontend/src/buildInfo.ts": "Exports the current build version constant v32.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays all hotel bookings with status, totals, and details, handling loading, error, and empty states. Uses tables and dialogs to show booking info and hotel names.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Provides controls for toggling hotel activation and subscription status. Shows hotels in a table with actions for admins to update visibility.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Manages creation and listing of invite tokens tied to hotel principals. Allows generating new tokens and copying existing ones.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access-denied message based on user role and activation status, with navigation options. Displays activation form when a hotel user needs activation.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays an error when permission checks fail, with options to retry or return home. Shows the underlying error message for debugging.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Handles validating and consuming invite tokens to activate hotel accounts. Updates relevant queries and redirects users after successful activation.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Shows a modal for new authenticated users to complete their profile and blocks access until a name is provided.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated via Internet Identity, showing a login prompt or loading state when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role, admin status, and optional hotel activation before granting access, showing error or denied screens otherwise.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays detailed booking info in a dialog with optional guest principal copying and payment proof status.",
  "frontend/src/components/booking/BookingForm.tsx": "Handles creating a booking with date validation, price calculation, and success confirmation.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing a human‑readable booking status with appropriate styling.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Lists the user’s bookings with hotel info, status, and quick access to view details.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Shows a fullscreen dialog containing a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug UI showing identity, principal, role, admin status, and hotel profile load state using various query hooks.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays hotel bookings, handles loading/errors, groups pending and confirmed bookings, and allows confirming pending bookings.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods, allowing adding and removing methods with form controls and query hooks.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Editable hotel profile form for name, location, address, map link, and contacts, with update and refetch logic.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Placeholder panel indicating stay‑recording is unavailable until backend support is added.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Renders room photo galleries with fallback handling, compact/full modes, and image‑error tracking.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "UI panel for creating and editing hotel rooms, handling image uploads, form state, and submission via API hooks.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription status with badges and alerts, and shows admin contact card when activation is needed.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with top navigation, content area, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Single-language selector component that manages locale state through context.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing links based on authentication, admin status, and hotel activation, plus login/logout controls.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Admin contact card for hotel activation and subscription, including WhatsApp, email, and payment method info.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's accepted payment methods and contact options such as WhatsApp and email.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state, including initializing, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user roles, profiles, admin actions, and hotel info.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements client-side room image upload handling using FileReader with progress tracking and data URL output.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a locale context with storage-backed language selection, currently supporting only 'en'.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user account status, roles, hotel access, and invite token actions with admin tools and refresh capabilities.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard page aggregating panels for invite tokens, hotel visibility, and booking management.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Lists available hotels with images, loading states, and room photo previews, allowing navigation to hotel details.",
  "frontend/src/pages/GuestAccountPage.tsx": "Guest account page showing booking management shortcuts and the bookings table.",
  "frontend/src/pages/HotelAreaPage.tsx": "Main hotel management interface with profile, rooms, payments, bookings, stays, and subscription tabs, including loading and error handling.",
  "frontend/src/pages/HotelDetailPage.tsx": "Shows detailed hotel info, rooms, and booking form based on hotelId, with loading and not‑found states.",
  "frontend/src/pages/MainMenuPage.tsx": "Landing menu letting users choose guest or hotel portals based on authentication and role status.",
  "frontend/src/pages/MyBookingsPage.tsx": "Page for users to view and manage their bookings with navigation shortcuts.",
  "frontend/src/types/extended-backend.ts": "Defines extended TypeScript interfaces and enums matching backend types for hotels, rooms, bookings, profiles, and queries.",
  "frontend/src/utils/debugFlags.ts": "Utility to detect whether debug mode is enabled via environment or URL param.",
  "frontend/src/utils/money.ts": "Money formatting helpers with currency symbols, names, and support checks.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating and filtering room picture URLs and tracking failed images.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors and animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Tracks the project's current feature state, regressions, and architectural notes for hotel profile, room creation, booking flow, and portal visibility."
}