{
  "backend/main.mo": "Defines core hotel-booking actor with data models for hotels, rooms, bookings, payments, invites, and access control using mixins for storage and authorization.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference or tooling consumption.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens with neutral and orange accents.",
  "frontend/index.html": "HTML entry file setting up page metadata, favicon, root mount point, and script entry.",
  "frontend/REGRESSION_CHECKLIST.md": "Markdown regression checklist covering authentication, hotel/room management, booking flow, and persistence testing.",
  "frontend/src/App.tsx": "Main React app configuring routing, auth/role guards, React Query client, layout shell, and global providers.",
  "frontend/src/buildInfo.ts": "Exports a constant containing the build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin panel component that fetches and displays all bookings in a sortable table with status badges and detail dialogs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Displays a table of hotels with controls to toggle active status and update subscription status, using query hooks and toast notifications.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Allows admins to generate and manage invite tokens for hotels, including principal validation and clipboard copy actions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with role requirements and optionally displays a hotel activation form.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Renders an error screen for permission check failures with retry and home navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Provides UI for validating and consuming invite tokens to activate a hotel account, with status indicators and toast feedback.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Blocks access until a logged‑in user without a profile submits basic information through a modal form.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and requires Internet Identity login, showing a login prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Wrapper component that checks user role, admin status, and optional hotel activation before rendering children, showing loading or access-denied states as needed.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog displaying full booking details with optional guest principal copying and status, date, guest count, and price information.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking by selecting dates and guests, calculating price, and submitting a createBooking mutation.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a styled badge showing a booking's status with variant and label mapping.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Modal dialog that displays a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug-only panel showing authentication info, user role, admin state, and hotel activation using various queries.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Panel listing bookings for the caller’s hotel with status badges and detail dialogs.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Panel to view, add, and remove a hotel’s payment methods with validation and mutation handling.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form panel that loads and edits hotel profile fields with validation and submits updates via mutation.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Displays eligible bookings and allows marking stays as completed using a mutation.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Shows room photos with fallback handling, thumbnails, and optional compact display mode.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creation and editing of hotel rooms, including image uploads and room listing display.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription and visibility status with contextual badges and payment instructions when needed.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper with top navigation, main content area, and footer.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Provides a locale selector UI component currently supporting English.",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar showing links based on authentication, user role, and hotel profile state with login/logout handling.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact and payment instructions for hotel activation or subscription with WhatsApp and email actions.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Shows a hotel's payment methods and provides contact buttons; falls back to contact-only view when no methods exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as roles, profiles, hotels, and invite tokens.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Provides a hook to upload images by converting them to data URLs and tracking upload progress.",
  "frontend/src/i18n/LocaleContext.tsx": "Defines a locale context with persistence to localStorage and a hook for accessing and updating the current locale.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user identity, role, hotel access, invite token handling, and admin actions.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders admin panels for managing invite tokens, hotel visibility, and bookings.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Lists available hotels with representative images and navigation to hotel details.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest account details and booking history with navigation to browse hotels or view booking details.",
  "frontend/src/pages/HotelAreaPage.tsx": "Hosts hotel management tabs for profile, rooms, payments, bookings, stays, and subscription, loading the hotel profile first.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays hotel details, rooms, photos, and booking UI with loading/error handling and image preview support.",
  "frontend/src/pages/MainMenuPage.tsx": "Renders the main menu with navigation to guest or hotel portals based on authentication and role.",
  "frontend/src/utils/debugFlags.ts": "Provides a helper to detect debug mode via dev environment or URL param.",
  "frontend/src/utils/money.ts": "Defines currency symbols, names, and functions for formatting and validating money values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Tracks project state, requirements, and issues related to implementing room photo display and permissions."
}