{
  "backend/main.mo": "Main canister actor defining hotel, room, booking, user, invite, and payment types with in-memory maps and admin initialization hooks.",
  "backend/migration.mo": "Migration module mapping old canister state to new state with identical structure via a pass‑through run function.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in routing, UI, hooks, and hotel/room features.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entrypoint setting metadata, favicon, and loading the React app root.",
  "frontend/REGRESSION_CHECKLIST.md": "Manual regression checklist covering auth, hotel/room management, booking flow, and upgrade persistence tests.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, React Query client, auth guards, and global layout.",
  "frontend/src/buildInfo.ts": "Exports build version constant for deployment identification.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays all bookings in a table with status, totals, and a details dialog, fetched via useGetBookings.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Lists hotels with controls to toggle active status and subscription state, using query mutations and status badges.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Manages invite tokens, allowing admins to generate tokens bound to a hotel's principal and view or copy existing tokens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access-denied message with role requirements and optionally a hotel activation form.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays an error when permission checks fail and provides retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Validates and consumes invite tokens to activate hotel accounts, providing feedback and success callbacks.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Shows a modal prompting authenticated users without a profile to enter basic info and saves it via API hooks.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps children and forces Internet Identity login, showing a loading or login card when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Enforces role-based access and optional hotel activation checks, showing loading, error, or access-denied screens accordingly.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays booking details in a dialog with optional copying of the guest principal.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking, calculating nights and total price, and submitting via createBooking.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing the booking status with variant and label mapping.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug panel showing real-time authentication, role, admin status, and hotel activation info.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays a table of hotel bookings with loading, empty state, and booking detail actions.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods, allowing adding and removing methods with validation and feedback.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Provides a form to edit hotel profile details including name, location, address, map link, and contact info.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Lists eligible bookings and allows marking stays as completed.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Shows room photos with validation, error handling, a main image, and thumbnails.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creation and editing of hotel rooms, including details, pricing, and image uploads.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays a hotel's subscription and visibility status and shows admin contact instructions when inactive or unpaid.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with top navigation, content area, and footer.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a language dropdown allowing selection of English.",
  "frontend/src/components/nav/TopNav.tsx": "Displays the main navigation bar with links shown based on user auth, role, and hotel/admin status.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact details for hotel activation or subscription payment.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays hotel payment methods and contact options or fallback contact instructions if none provided.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth, storing identity state and providing login/logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user roles, profiles, hotels, and invite tokens using an actor API.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements a hook for uploading images as data URLs with progress tracking and support for pre-existing data URLs.",
  "frontend/src/i18n/LocaleContext.tsx": "Defines a locale context provider storing the current locale in localStorage and exposes a hook for accessing and updating it.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark theme CSS variables for colors, borders, and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders account status details, invite token validation/consumption, and admin tools based on the user’s role and profile.",
  "frontend/src/pages/AdminPanelPage.tsx": "Displays admin management panels for invite tokens, hotel visibility, and bookings.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and lists hotels with basic info and navigation to detailed booking pages.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows a guest’s bookings and navigation to browse hotels or view account status.",
  "frontend/src/pages/HotelAreaPage.tsx": "Renders the hotel management dashboard with tabs for profile, rooms, payments, bookings, stays, and subscription, handling loading and missing-profile states.",
  "frontend/src/pages/HotelDetailPage.tsx": "Loads and displays detailed hotel and room information, handling errors and showing booking options with image previews.",
  "frontend/src/pages/MainMenuPage.tsx": "Displays the main menu with navigation to guest or hotel portals, checking authentication, roles, and hotel activation status.",
  "frontend/src/utils/debugFlags.ts": "Provides a helper to detect debug mode via environment or URL parameters.",
  "frontend/src/utils/money.ts": "Contains currency symbols, names, and utilities for formatting amounts consistently across the app.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Describes a project to fix inconsistent room photo storage and visibility across user roles, including current issues, existing features, and new feature requests. Contains metadata about project state, known bugs, and architectural expectations for photo handling."
}