{
  "backend/main.mo": "Defines hotel booking canister types, storage maps, and mixin-based authorization and invite-link logic with partial invite code generation.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files for reference or build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark mode theming.",
  "frontend/index.html": "HTML entry point setting up meta tags, favicon, root div, and loading the main React script.",
  "frontend/REGRESSION_CHECKLIST.md": "Markdown checklist for validating authentication, authorization, room management, and booking flows after the V24 behavior restoration.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, auth/role guards, QueryClient, and rendering AppShell.",
  "frontend/src/buildInfo.ts": "Exports the build version constant set to 'v24-restored'.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays a table of all bookings with status, totals, and a details dialog, using a bookings query and loading states.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Shows hotels with controls to toggle active status and subscription level, including badges and async updates with toast feedback.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Allows admins to generate invite tokens bound to a hotel principal and list existing tokens with copy functionality and validation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access denied message with required role info, navigation options, and a hotel activation flow when needed.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays permission-check errors with retry and home navigation options, reloading role queries on retry.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Lets hotel users validate and consume invite tokens to activate accounts, providing success/error toasts and form feedback.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Gate component that forces newly authenticated users without a saved profile to complete a name/email/phone form before accessing children.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and blocks access until Internet Identity login is complete, showing a login prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role, admin status, and hotel activation before rendering children, showing loading or error screens when access is restricted.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog that displays detailed booking information and optionally allows copying the guest principal ID.",
  "frontend/src/components/booking/BookingForm.tsx": "Booking form for selecting dates and guest count, calculating price, and submitting a new booking request.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Badge component that maps booking status values to user-friendly labels and visual variants.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Modal dialog for displaying a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug panel showing real‑time Internet Identity authentication, role, admin status, and hotel activation details.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays a table of hotel bookings fetched by hotel ID with loading and empty states, including status badges and a details dialog.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods allowing adding and removing methods with validation, form handling, and table display.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Allows editing hotel profile details including name, location, address, map link, and contact info with validation and update submission.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Lists eligible bookings to mark stays as completed and provides an action to record stay completion with loading and empty states.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Renders room photos with failed-image handling, thumbnail grids, and optional compact mode with click callbacks.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Displays and manages hotel rooms, supporting creation and editing of room details with image uploads and a modal form.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription and activation status with badges and alerts, showing contact instructions when inactive or unpaid.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout wrapper with top navigation, content area, and footer showing build information.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a language dropdown allowing users to switch the locale (currently only English).",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar handling login/logout, user role checks, and conditional links for admin, hotel, and account areas.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact and payment info for hotel activation or subscription with WhatsApp and email actions.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Lists hotel payment methods and provides buttons to contact the hotel via WhatsApp or email.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context for login, logout, identity retrieval, and authentication state handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user roles, profiles, admin status, and invite tokens via the backend actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements a hook for uploading image files as data URLs with progress tracking and simple error handling.",
  "frontend/src/i18n/LocaleContext.tsx": "Defines a locale context with persistence in localStorage and exposes a provider and hook for accessing and updating the app's locale.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and design tokens.",
  "frontend/src/main.tsx": "Sets up the React root, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user identity, role, hotel profile status, and supports invite token validation, token consumption, and admin elevation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard containing panels for managing invite tokens, hotel visibility, and bookings.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and displays hotels with representative room photos, including preview and fallback handling for missing images.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows a guest’s bookings overview and navigation options, including browsing hotels and viewing account status.",
  "frontend/src/pages/HotelAreaPage.tsx": "Hotel management dashboard that loads the caller’s hotel profile and displays panels for profile, rooms, payments, bookings, stays, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays public hotel details, rooms, photos, and booking form based on hotelId from the URL, handling loading and missing states.",
  "frontend/src/pages/MainMenuPage.tsx": "Main landing menu allowing navigation to guest or hotel portals, with logic based on authentication, roles, and hotel activation.",
  "frontend/src/types/extended-backend.ts": "Type definitions mirroring the backend API, including hotels, rooms, bookings, payments, subscriptions, and queries.",
  "frontend/src/utils/debugFlags.ts": "Utility that enables debug mode in development or when the URL contains debug=1.",
  "frontend/src/utils/money.ts": "Currency formatting utilities with supported currency lists and helpers for names and validation.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating, filtering, and tracking room picture URLs including direct blobs and data URLs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using both query strings and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project rollback state, describing Version 25 role regression issues, existing features, and pending authorization fix requests."
}