{
  "backend/main.mo": "Defines core types and state for hotels, rooms, bookings, payments, and invite tokens, integrating storage, authorization, and migration mixins.",
  "backend/migration.mo": "Provides a no-op migration module that returns old actor state unchanged while defining legacy structure schemas.",
  "feature_evidence.json": "Structured report listing requested features, related files, components, and test IDs for compatibility restoration and room upload fixes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files describing their roles in routing, UI, state, and compatibility handling.",
  "frontend/index.css": "Defines global Tailwind-based styling with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that sets metadata and loads the React app from main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Comprehensive regression checklist covering compatibility, admin features, hotel flows, room uploads, and error handling before release.",
  "frontend/RELEASE_NOTES.md": "Template documenting release details with v47 notes focused on backend compatibility restoration and blob-based room photo uploads.",
  "frontend/src/App.tsx": "Defines the React app root, query client, and full routing tree with authentication and role gates.",
  "frontend/src/buildInfo.ts": "Exports the app build version constant.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin panel showing all bookings with loading, error, and table views, including booking details and hotel lookup.",
  "frontend/src/components/admin/CaffeineDeployUiNotice.tsx": "Displays an admin notice about a known deploy UI issue on the Caffeine platform.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Admin utility for removing legacy room photos and payment methods by hotel principal and room ID.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Admin interface to view hotels and update their activation and subscription status.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Panel for generating and managing invite codes, with options for max uses and optional bound principals.",
  "frontend/src/components/admin/PrincipalPurgePanel.tsx": "UI panel allowing admins to validate a principal ID and trigger a purge mutation with confirmation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with role requirements and optional hotel activation flow.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Shows an error screen for failed permission checks with retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Handles invite token validation and hotel account activation with related query refreshes.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Prompts authenticated users without a profile to complete basic profile fields before continuing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and requires Internet Identity authentication, showing a login prompt if needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Enforces role-based access, optional hotel activation checks, and handles loading and error states.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Shows a dialog with detailed booking info including dates, guests, price, status, and optional user principal copying.",
  "frontend/src/components/booking/BookingForm.tsx": "Provides a form for creating bookings with validation, price calculation, and booking submission handling.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing a booking’s status with variant and label mapping.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Displays the logged-in user's bookings with status, details dialog access, and cancel functionality.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Shows a full-screen dialog for previewing an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays real-time authentication, role, and hotel profile diagnostic info for debugging.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Lists hotel bookings with options to confirm or cancel and supports viewing booking details.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "UI panel to view, add, and remove hotel payment methods using profile query/update hooks, with form validation and toast notifications.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form-driven panel for editing hotel name, location, address, map link, and contact details with profile fetch and update logic.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Static panel informing users that stay-recording functionality is unavailable until backend support is implemented.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with support for viewing, replacing, and deleting images, including error tracking for failed URLs.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creation, editing, and deletion of hotel rooms, including pricing, promo validation, image uploads, and photo management.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows subscription status with badges and alerts, and displays instructions when the subscription is inactive or in test mode.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper providing navigation, main content area, and footer with build version.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Language selector component allowing switching the app locale, currently supporting English only.",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar showing links based on user authentication, admin role, and hotel activation, with login/logout handling.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact info and payment methods for hotel activation or subscription with WhatsApp and email actions.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Shows a hotel’s payment methods and provides buttons to contact the hotel via WhatsApp or email.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state management, and stored identity restoration through a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user roles, profiles, and hotel-related data using the backend actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles image upload with validation, progress tracking, error handling, and support for single or multiple uploads.",
  "frontend/src/i18n/LocaleContext.tsx": "Simple locale context allowing storing and updating the current UI language in localStorage.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines light/dark theme CSS variables for colors, borders, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user identity, roles, hotel activation state, and actions like copying principal, refreshing status, and requesting admin access.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard with panels for invites, hotel visibility, bookings, data cleanup, and principal purging.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and lists hotels with thumbnails, handling preview dialogs and image errors, and navigates to hotel details.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest account actions including navigating to bookings, browsing hotels, and displaying the user's bookings table.",
  "frontend/src/pages/HotelAreaPage.tsx": "Loads the caller’s hotel profile and displays management tabs for profile, rooms, payments, bookings, and subscriptions with error handling.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays detailed hotel info including address, contact, payment methods, room listings, and booking form, with loading and not-found states.",
  "frontend/src/pages/MainMenuPage.tsx": "Renders the main menu with navigation to guest and hotel portals, using auth and role queries to determine access.",
  "frontend/src/pages/MyBookingsPage.tsx": "Displays the user's bookings with navigation shortcuts to browsing hotels and viewing account status.",
  "frontend/src/types/extended-backend.ts": "Defines TypeScript interfaces and enums for bookings, hotels, rooms, users, and related backend data structures.",
  "frontend/src/utils/debugFlags.ts": "Provides a helper to check if debug mode is enabled based on environment or URL parameters.",
  "frontend/src/utils/money.ts": "Contains currency formatting utilities and supported currency definitions for consistent money display.",
  "frontend/src/utils/roomBlobStorage.ts": "Implements placeholder image upload functions returning data URLs with optional progress tracking.",
  "frontend/src/utils/roomPictures.ts": "Provides utilities for validating, filtering, and tracking failures of room picture URLs.",
  "frontend/src/utils/roomPricing.ts": "Offers bigint-safe promo validation and discounted price calculations plus promo display formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the current project state, issues, and required fixes, focusing on restoring stable hotel/admin behavior and improving the room upload feature. Lists existing features, known regressions, and policy constraints for upcoming work."
}