{
  "backend/main.mo": "Defines the backend actor with hotel, room, booking, payment, invite-token, and access-control data types and storage maps, forming the core state model for the hotel booking system.",
  "feature_evidence.json": "Lists feature evidence reports linking features to affected files, components, test IDs, and confidence levels for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including routes, hooks, components, pages, and build metadata.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark themes, and global visual settings.",
  "frontend/index.html": "HTML entry point loading the root React app with title, favicon, meta tags, and main script.",
  "frontend/REGRESSION_CHECKLIST.md": "Detailed pre‑release regression checklist covering authentication, bookings, payments, hotel management, and cleanup verification steps.",
  "frontend/RELEASE_NOTES.md": "Release notes template with sections for V33, V40+, and V39 describing deploy verification, cleanup tasks, and known issues.",
  "frontend/src/App.tsx": "Sets up the React app with routing, auth gates, query client, and page routes including admin and hotel areas.",
  "frontend/src/buildInfo.ts": "Exports the current build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays an admin table of all bookings with hotel info, status, and details, including loading and error states.",
  "frontend/src/components/admin/CaffeineDeployUiNotice.tsx": "Shows an informational admin alert about a known deploy UI issue on the Caffeine platform.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Provides admin tools to remove legacy room photos and payment methods by hotel principal and room ID.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Allows admins to view hotels and update their active and subscription statuses.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Enables admins to generate, validate, and manage hotel invite tokens tied to principal IDs.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message, showing required roles and optional hotel activation form, with navigation options.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Shows an error when permission checks fail and provides retry and home navigation actions.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form for validating and consuming an invite token to activate a hotel account with related query refresh and navigation.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Ensures authenticated users complete basic profile data before accessing content, showing a modal form when needed.",
  "frontend/src/components/auth/RequireAuth.tsx": "Gate component that blocks access until the user logs in via Internet Identity.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role and optional hotel activation status, showing loading, error, or access-denied screens as needed.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog showing detailed booking information, pricing, dates, and optional guest principal copy action.",
  "frontend/src/components/booking/BookingForm.tsx": "Booking form that validates dates and guest counts, calculates price, and submits a booking request using user identity.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Displays a booking status badge with variant and label determined by booking status.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Shows the current user's bookings with details, cancellation options, and loading/error states.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Dialog for previewing an image with a title and close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Diagnostic panel showing authentication state, principal, role, admin status, and hotel profile info.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays bookings for the hotel owner with actions to confirm or cancel bookings and full loading/error handling.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Panel for hotel owners to view, add, and remove payment methods with form handling and validation.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form panel that loads, displays, and updates a hotel's profile details with validation and mutation hooks.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Static panel showing that stay-recording is unavailable until backend booking features are implemented.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with fallback handling and optional compact layout, supporting clickable thumbnails and failed-image tracking.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "UI for creating and editing hotel rooms, including image uploads, room details, and integration with backend mutations.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows subscription status for a hotel with badges, alerts, and optional contact instructions depending on activation state.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper providing navigation, content area, and footer displaying build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Language selection dropdown currently supporting English, using locale context.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with authentication actions, routing links, role-based admin/hotel options, and language selector.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Component showing admin contact and payment methods for hotel activation or subscription, with WhatsApp/email actions and static payment info.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays hotel-specific payment methods and contact links for guest bookings, conditionally rendered based on data availability.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user roles, profiles, hotel activation status, and related backend operations.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Hook handling image uploads by converting files to data URLs with progress tracking and simulated upload flow.",
  "frontend/src/i18n/LocaleContext.tsx": "Context provider storing and updating the app locale, persisted in localStorage.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and base styling for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user identity, role, hotel activation state, and allows invite token validation, consumption, and admin self‑elevation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard hosting panels for invite tokens, hotel visibility, bookings, cleanup, and deployment notices.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and lists hotels with images and navigation to details, handling loading, empty states, and image preview.",
  "frontend/src/pages/GuestAccountPage.tsx": "Guest account hub showing navigation to bookings and account status plus the user's bookings table.",
  "frontend/src/pages/HotelAreaPage.tsx": "Hotel management portal with tabs for profile, rooms, payments, bookings, stays, and subscription, with load/error handling.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays a specific hotel's details, rooms, photos, payment methods, and booking form.",
  "frontend/src/pages/MainMenuPage.tsx": "Landing menu choosing guest or hotel portal based on auth, role, and hotel activation state.",
  "frontend/src/pages/MyBookingsPage.tsx": "A React page that displays the user's bookings and provides navigation cards for browsing hotels and viewing account status.",
  "frontend/src/types/extended-backend.ts": "Type definitions mirroring backend data structures and API interfaces for hotels, rooms, bookings, profiles, and admin operations.",
  "frontend/src/utils/debugFlags.ts": "Utility to detect whether debug mode is enabled based on environment or URL parameters.",
  "frontend/src/utils/money.ts": "Currency utilities for formatting money values and validating supported currency codes.",
  "frontend/src/utils/roomPictures.ts": "Helpers for validating, filtering, and tracking failed room picture URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using both search and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, animations, plugins, and container settings.",
  "project_state.json": "Project state file summarizing current issues, features, and pending requests for the SGO-Booking app."
}