{
  "backend/main.mo": "Defines hotel, room, booking, payment, invite token, and user profile types with storage maps and initial admin setup for the backend actor.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of human-written summaries describing the purpose of each frontend file and component.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables and light/dark theme definitions.",
  "frontend/index.html": "Base HTML document configuring metadata, favicon, root element, and main script entry point.",
  "frontend/REGRESSION_CHECKLIST.md": "Regression testing checklist covering rollback verification, authentication, admin panel, hotel features, UI/UX, and performance.",
  "frontend/RELEASE_NOTES.md": "Release notes detailing v44 rollback, restored functionality, technical changes, verification steps, and previous version notes.",
  "frontend/src/App.tsx": "Sets up the React app shell, React Query client, and full route tree with authentication and role guards.",
  "frontend/src/buildInfo.ts": "Exports the current frontend build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays an admin table of all bookings with loading, error, and empty states plus booking details.",
  "frontend/src/components/admin/CaffeineDeployUiNotice.tsx": "Shows an admin notice about Caffeine deploy UI issues and provides cache-busting and reload options.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Provides admin tools to remove legacy room photos and payment methods using backend cleanup calls.",
  "frontend/src/components/admin/DeploymentPublishInfoPanel.tsx": "Shows build version and environment info with copy-to-clipboard actions for admin debugging.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Allows admins to view all hotels and toggle activation or update subscription status.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "UI for generating invite tokens, binding them to principals, and listing active/used tokens with copy functionality.",
  "frontend/src/components/admin/PrincipalPurgePanel.tsx": "Admin panel for validating a principal ID and purging all associated hotel data after confirmation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays access-denied messaging based on user role and activation state, with navigation options and optional activation form.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Error screen shown when permission checks fail, allowing retry or navigation home.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form for validating and consuming invite tokens to activate a hotel account, triggering query refresh and navigation.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Gate component requiring new authenticated users to fill out basic profile info before accessing children content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that checks Internet Identity authentication and prompts login if the user is unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards child components by checking user identity, role, admin status, and optional hotel activation, showing loading or access-denied screens as needed.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays a dialog with detailed booking info including dates, price, guest data, and optional guest principal copying.",
  "frontend/src/components/booking/BookingForm.tsx": "Handles booking creation with form validation, price calculation, date checks, and submission to the booking API.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing a booking’s status with mapped labels and visual variants.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Shows the user’s bookings with status, details dialog, and cancel actions, including loading and error states.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Displays a modal dialog showing a full‑size preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays real‑time authentication, role, admin status, and hotel profile diagnostics for debugging.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays hotel bookings, allows confirming or canceling them, and handles loading, errors, and empty states.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods with add/remove functionality and profile updates.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Shows and edits hotel profile fields including name, location, address, map link, and contact details.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Static panel informing that stay recording is unavailable until backend support exists.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with previewing and optional editing, deletion, and replacement features.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Handles creating, editing, and deleting hotel rooms, including pricing, promotions, and photo management.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription status with badges, alerts, and admin contact card based on fetched profile data.",
  "frontend/src/components/layout/AppShell.tsx": "Provides page layout with top navigation, main content area, and footer showing build version.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a simple language selector allowing users to switch locale, currently only English.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing routes and login/logout actions based on authentication, admin, and hotel activation state.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact info and payment methods for hotel activation or subscription management.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and provides quick access to WhatsApp or email contact.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, role, and hotel data, including helper converters for backend types.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Implements image upload logic with size/type validation, progress tracking, and error handling for room photos.",
  "frontend/src/i18n/LocaleContext.tsx": "Defines a locale context storing the current language in localStorage with a provider and hook.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles for the app.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, React Query, Internet Identity provider, and global CSS.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user account info, roles, hotel activation status, and admin tools with refresh and copy actions.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard with panels for invite tokens, hotel visibility, bookings, cleanup, and deployment info.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Lists all hotels with representative images, handling loading states, image errors, and navigation to details.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest booking tools and links to browse hotels or view account status, plus the user’s bookings table.",
  "frontend/src/pages/HotelAreaPage.tsx": "Renders the hotel management dashboard with tabs for profile, rooms, bookings, payments, and subscription, handling loading, errors, and deactivated accounts.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays public hotel details, contact info, rooms, and booking form, loading the hotel by route param and handling missing hotels.",
  "frontend/src/pages/MainMenuPage.tsx": "Shows the main entry menu for guests and hotel owners, routing users based on authentication, role, and activation status.",
  "frontend/src/pages/MyBookingsPage.tsx": "Displays the user's bookings table with quick links to browse hotels and view account status.",
  "frontend/src/types/extended-backend.ts": "Defines TypeScript interfaces and enums representing backend hotel, room, booking, and subscription data structures.",
  "frontend/src/utils/debugFlags.ts": "Enables debug mode based on environment or a URL parameter.",
  "frontend/src/utils/money.ts": "Provides currency symbols, formatting, and validation utilities for displaying money values.",
  "frontend/src/utils/roomBlobStorage.ts": "Temporary file-upload utilities that convert images to data URLs, with support for progress callbacks and multi-file uploads.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating, filtering, and tracking failures of room picture URLs for display.",
  "frontend/src/utils/roomPricing.ts": "Bigint-safe utilities for validating promo percentages and computing discounted room prices.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist or clear them as needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, features, issues, and pending requests for the Hotel Admin Portal, including deployment concerns and new feature tasks."
}