{
  "backend/main.mo": "Defines the main booking canister with hotel, room, booking, payment, invite token, and subscription types plus maps and admin authorization helpers.",
  "backend/migration.mo": "Contains migration logic converting old actor state to the new schema including added hotel contact and subscription fields.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, tests, and confidence levels for tracking changes.",
  "frontend-file-summaries.txt": "Provides short descriptions of all key frontend files and their responsibilities across routing, components, and state management.",
  "frontend/index.css": "Defines global styles and color variables using Tailwind with light/dark theme support.",
  "frontend/index.html": "HTML entry point loading the React application root and main script with metadata and favicon.",
  "frontend/REGRESSION_CHECKLIST.md": "Markdown checklist outlining critical frontend flows, role logic, and validation steps for regression testing.",
  "frontend/src/App.tsx": "Sets up the React app with routing, query client, localization, and protected routes for guest, hotel, and admin pages.",
  "frontend/src/buildInfo.ts": "Exports the build version identifier.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays a bookings table for admins with loading states and booking detail dialogs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Provides admin controls for hotel activation and subscription status with status badges and update actions.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Allows admins to generate and manage hotel invite tokens bound to principals with validation and copy actions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access-denied page with role info and optional hotel activation workflow.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays an error screen for permission-check failures with retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form UI that validates and consumes an invite token to activate a hotel account, with success and error handling.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Checks if a logged‑in user lacks a profile and, if so, forces completion of a name/email/phone form before allowing access.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks children until Internet Identity authentication is complete, showing a login prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access guard that checks user role, admin override, and hotel activation status before rendering children.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog displaying full booking details with formatting and optional copy‑to‑clipboard of the guest principal.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking by selecting dates and guests, calculating total price, and submitting the booking request.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Badge that maps booking status values to labeled UI variants.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays a debug-only authentication panel showing identity, role, admin status, and hotel activation based on loaded query data.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Shows a hotel's bookings with loading, empty, and table states, including booking details and status badges.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Allows hotels to view, add, and remove payment methods with form validation and mutation actions.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Provides a form to update hotel profile details with validation for map links and email.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Lists eligible bookings and lets hotels mark stays as completed using a mutation action.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages hotel rooms, allowing creation and editing with image uploads and price/currency settings.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription status with badges/messages and shows admin contact instructions when inactive or unpaid.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with navigation, main content area, and a footer.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Renders a language dropdown allowing users to switch the UI locale, currently supporting English only.",
  "frontend/src/components/nav/TopNav.tsx": "Renders the top navigation bar with dynamic links based on authentication, roles, and hotel/admin status.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact info and payment methods for hotel activation or subscription issues.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and provides contact buttons when available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user roles, profiles, hotels, and invite tokens via the actor API.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a React context for storing and updating the UI locale, persisted to localStorage.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, color variables, themes, and global styling for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the account status UI, allowing users to view roles, validate or consume invite tokens, and refresh account data.",
  "frontend/src/pages/AdminPanelPage.tsx": "Displays the admin dashboard with panels for invite tokens, hotel visibility, and booking management.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Shows a list of hotels retrieved from the API and links to detailed booking pages.",
  "frontend/src/pages/GuestAccountPage.tsx": "Displays the guest’s bookings, navigation to browsing hotels, and account status actions.",
  "frontend/src/pages/HotelAreaPage.tsx": "Provides the hotel management interface with tabs for profile, rooms, payments, bookings, stays, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Renders a hotel detail view with room listings, booking handling, and user/profile checks using various queries and UI components.",
  "frontend/src/pages/MainMenuPage.tsx": "Provides the main entry menu allowing navigation to guest or hotel portals based on authentication and hotel/admin status.",
  "frontend/src/utils/debugFlags.ts": "Exposes a helper to detect debug mode based on environment or URL parameters.",
  "frontend/src/utils/money.ts": "Defines currency symbols and utilities for formatting money values and validating supported currencies.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters, including sessionStorage fallback and hash parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, feature requirements, issues, and pending actions related to hotel booking pricing and hotel-specific payment/contact info."
}