{
  "backend/main.mo": "Defines core actor logic with types and storage maps for hotels, rooms, bookings, payments, profiles, and invite tokens, including hardcoded admin and access-control integration.",
  "feature_evidence.json": "Feature evidence report describing a targeted regression verification pass and its related files, components, and test ID.",
  "frontend-file-summaries.txt": "Lists auto‑generated summaries of numerous frontend source files including routing, hooks, pages, components, and build metadata.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark modes with consistent UI theming tokens.",
  "frontend/index.html": "HTML entry point setting up metadata, favicon, and bootstrapping the frontend via main.tsx.",
  "frontend/REGRESSION_CHECKLIST.md": "Pre‑release regression checklist covering authentication, booking flows, hotel management, payments, and HOTEL DUMMY purge verification steps.",
  "frontend/RELEASE_NOTES.md": "Release notes template containing verification checklists for versions V40+, V39, and future releases, focusing on cleanup tasks and key flows.",
  "frontend/src/App.tsx": "Sets up React Query, routing, authentication gates, and renders the main app shell with all page routes.",
  "frontend/src/buildInfo.ts": "Exports the static build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays an admin table of all bookings with hotel info, status, and booking details handling loading and error states.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Provides admin tools to remove legacy room photos and payment methods for a hotel, with input validation and result logs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Allows admins to toggle hotel active status and subscription level using a table interface.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Lets admins generate and manage hotel invite tokens after validating a principal ID.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access-denied message, explains required roles, and provides navigation or hotel activation options.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Displays an error screen for permission check failures with retry and home navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Provides a form to validate and consume hotel invite tokens and triggers activation-related query invalidations and navigation.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Blocks access until the authenticated user completes a basic profile form and saves it via API.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and forces Internet Identity authentication, showing a login prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role, admin status, and optional hotel activation before rendering children or showing denial/error screens.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Shows booking details in a dialog including dates, guests, rooms, status, price, and optional guest principal copying.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating bookings with date validation, price calculation, and success display after API submission.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Displays a badge showing a booking's status with corresponding label and style variant.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Fetches and displays a user's bookings in a table with options to view details and cancel pending bookings.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Shows a dialog containing a large preview of an image with a close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays authentication, role, and hotel-profile diagnostic information for debugging access issues.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Lists hotel-specific bookings with controls to confirm or cancel and view booking details.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages a hotel's payment methods, allowing adding and removing entries.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Allows hotel owners to view and update their hotel profile and contact information.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Placeholder panel noting that stay-recording functionality is not yet available.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Displays room photos with fallback handling, showing thumbnails and a main image in compact or full layout, and tracks failed image loads.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Provides UI for creating and editing hotel rooms, including form handling, image upload, and displaying room photos.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows the hotel's subscription status with badges and alerts, and provides admin contact instructions when inactive.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app layout with top navigation, main content area, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Offers a simple language dropdown allowing selection of English.",
  "frontend/src/components/nav/TopNav.tsx": "Renders the top navigation bar with links, login/logout, admin and hotel area access, and language selection based on user state.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact information and payment methods for hotel activation and subscription only.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays hotel payment methods and contact options, rendering cards for methods and buttons for WhatsApp or email if available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, storing identity state, handling login/logout, and exposing status through React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user roles, profiles, hotel activation status, and invite token actions using the backend actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles room image uploads by converting files to data URLs and tracking upload progress.",
  "frontend/src/i18n/LocaleContext.tsx": "Implements a locale context with persistence in localStorage, allowing components to read and update the active locale.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with consistent color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays the user's authentication, role, and hotel access status with tools to validate and consume invite tokens and refresh account data.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin dashboard with sections for managing invite tokens, hotel visibility, bookings, and system cleanup.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Lists all active hotels with thumbnails and allows users to preview photos and navigate to hotel details.",
  "frontend/src/pages/GuestAccountPage.tsx": "Provides guests with quick access to their bookings and account status, plus a table of all their reservations.",
  "frontend/src/pages/HotelAreaPage.tsx": "Main management interface for hotel owners, offering tabs for profile, rooms, payments, bookings, stays, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Shows detailed hotel information, room listings, photos, payment methods, and booking options for a selected hotel.",
  "frontend/src/pages/MainMenuPage.tsx": "Landing menu that directs users to guest or hotel portals based on authentication, admin status, and hotel activation.",
  "frontend/src/pages/MyBookingsPage.tsx": "React page showing user bookings with actions to browse hotels and view account status.",
  "frontend/src/types/extended-backend.ts": "Defines TypeScript interfaces and enums matching backend types and the ExtendedBackendInterface API surface.",
  "frontend/src/utils/debugFlags.ts": "Utility to enable debug mode based on environment or URL parameter.",
  "frontend/src/utils/money.ts": "Currency helpers for formatting amounts and validating supported currencies.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating, filtering, and tracking room picture URLs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL/session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout utilities.",
  "project_state.json": "Tracks project state, backend issues, and architectural notes for fixing booking, hotel, and data cleanup flows."
}