{
  "backend/main.mo": "Defines the main actor with hotel, room, booking, payment, user profile, and invite token types plus storage maps and initial state for the backend canister.",
  "backend/migration.mo": "Implements migration logic removing data linked to a deprecated hotel ID and returning a filtered actor state after upgrade.",
  "feature_evidence.json": "Lists feature evidence records mapping features to involved frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for numerous frontend files describing their purpose and behavior.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base element styling.",
  "frontend/index.html": "Provides the HTML shell with root div and loads the main React entry point.",
  "frontend/REGRESSION_CHECKLIST.md": "Provides a detailed pre-release regression checklist covering auth, booking flows, hotel management, payments, and activation gating.",
  "frontend/RELEASE_NOTES.md": "Template and examples for release notes documenting changes, verification steps, and rollback plans for multiple versions.",
  "frontend/src/App.tsx": "Sets up React Query, routing, authentication gates, and app layout for all pages.",
  "frontend/src/buildInfo.ts": "Exports the static build version string.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays an admin bookings table with loading, error, and detail views using fetched booking and hotel data.",
  "frontend/src/components/admin/CaffeineDeployUiNotice.tsx": "Shows an informational alert about a known deploy UI issue on the Caffeine platform.",
  "frontend/src/components/admin/DataCleanupPanel.tsx": "Provides admin tools to remove legacy room photos and payment methods via actor calls with UI feedback.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Lets admins view and modify hotel activation and subscription status with real-time updates.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "Admin UI for generating invite tokens tied to hotel principals, validating input, and listing existing tokens with copy functionality.",
  "frontend/src/components/admin/PrincipalPurgePanel.tsx": "Provides a confirmation-based interface for admins to purge all data for a given hotel principal after validating the ID.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays role-based access denial messaging and offers navigation or hotel activation steps when required.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Shows an error screen when permission checks fail and allows retrying or returning home.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "UI for validating and consuming invite tokens to activate a hotel account, with query invalidation and redirect after success.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Gate that prompts authenticated users without a profile to complete required details before accessing content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that ensures users are authenticated via Internet Identity before rendering children, otherwise prompts login.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards children by checking user role, admin bypass, and optional hotel activation, showing loaders or error/denied screens as needed.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog showing detailed booking info including dates, guests, rooms, price, and optional guest principal with copy support.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking with date validation, price calculation, and submission via createBooking, displaying success on completion.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a status badge with variant and label based on a booking's status.",
  "frontend/src/components/booking/MyBookingsTable.tsx": "Displays user's bookings with hotel names, details dialog, and cancellation flow plus loading and error states.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Dialog to display a large preview of an image with title and close button.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Diagnostic panel showing authentication, principal, role, admin status, and hotel profile state for debugging.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays a hotel's bookings with actions to confirm or cancel bookings, handling loading, errors, and dialogs.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Lets hotels add or remove payment methods, updating the profile and refetching data with validation and error handling.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Provides a form for editing hotel profile details and contact info, with loading states and update submissions.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Shows a placeholder panel indicating stay-recording functionality is not yet available.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Renders room photos with fallback handling for failed images and supports both full and compact layouts.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creation and editing of rooms, including image uploads, form validation, and room list interactions.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Displays hotel subscription status with badges, alerts, and optional admin contact card depending on payment and activation state.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with top navigation, main content area, and footer showing build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Provides a simple locale selector limited to English using a dropdown UI.",
  "frontend/src/components/nav/TopNav.tsx": "Renders the main navigation bar with links, authentication controls, and conditional admin/hotel area access.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Shows admin contact info and payment methods for hotel activation or subscription only.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and contact options if available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user roles, profiles, tokens, and admin actions using the backend actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Custom hook for uploading images by converting them to data URLs with progress tracking.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a locale context for storing and updating the app's language preference.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and theming for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user account status, roles, hotel activation, and invite token tools with refresh capabilities.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard aggregating panels for invites, hotels, bookings, purging, and system notices.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Lists available hotels with images and navigation, including fallback behavior for image load errors.",
  "frontend/src/pages/GuestAccountPage.tsx": "Guest dashboard offering access to bookings and account status with navigation controls.",
  "frontend/src/pages/HotelAreaPage.tsx": "Renders the hotel management dashboard with tabs for profile, rooms, payments, bookings, stays, and subscription, handling loading and profile access errors.",
  "frontend/src/pages/HotelDetailPage.tsx": "Displays public hotel details, rooms, photos, and booking form, fetching data by hotelId and handling loading and missing hotel states.",
  "frontend/src/pages/MainMenuPage.tsx": "Provides the main portal selection page for guests and hotel users, showing options based on authentication, role, and hotel activation state.",
  "frontend/src/pages/MyBookingsPage.tsx": "Shows the user's bookings table and provides shortcuts to browse hotels or view account status.",
  "frontend/src/types/extended-backend.ts": "Defines extended TypeScript interfaces and enums matching backend types for hotels, rooms, bookings, payments, and queries.",
  "frontend/src/utils/debugFlags.ts": "Enables debug mode based on development environment or a URL parameter.",
  "frontend/src/utils/money.ts": "Provides currency formatting utilities and supported currency metadata.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating, filtering, and tracking hotel room picture URLs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, animations, container settings, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project state describing requirements for principal‑ID data purging, re‑registration flow, and related admin and safety features."
}