{
  "backend/main.mo": "Defines core hotel, room, booking, payment, and invite types, initializes system-level maps, and exposes admin and invite-related canister methods with mixins for storage and authorization.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files covering routing, components, hooks, styles, and pages.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, root element, and script loader for the React app.",
  "frontend/REGRESSION_CHECKLIST.md": "Pre‑release checklist detailing authentication, hotel/room management, booking flow, and regression steps with emphasis on room creation and visibility.",
  "frontend/src/App.tsx": "Main React app configuring QueryClient, router routes, auth/role guards, locale provider, and app shell layout.",
  "frontend/src/buildInfo.ts": "Exports the build version constant for deployment identification.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin panel component fetching all bookings and rendering them in a table with statuses, totals, and detail dialogs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Admin panel listing hotels with controls to toggle active status and subscription state, showing badges and guidance.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "UI for generating, validating, and listing hotel invite tokens bound to principals, with copy and error handling features.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denial screen showing required roles, navigation options, and hotel activation workflow when needed.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Error screen for permission guard failures with retry and navigation actions.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form to validate and consume invite tokens to activate a hotel account, showing validation results and status.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Gate that prompts authenticated users without a profile to complete required fields before continuing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Component enforcing Internet Identity authentication, showing login prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRole.tsx": "Role guard component that checks user role, admin status, and hotel activation before rendering children or showing access/error screens.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Dialog showing detailed booking information with optional guest principal copying and status display.",
  "frontend/src/components/booking/BookingForm.tsx": "Form for creating a booking, calculating nights and price, and submitting booking data via mutation.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Maps booking status values to human-readable labels and badge variants for display.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Debug panel showing authentication state, user role, admin status, and hotel activation info.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Displays a table of hotel bookings with details, status badges, and access to the booking details dialog.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Interface for viewing, adding, and removing a hotel's payment methods with validation and mutation calls.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form panel allowing hotel owners to view and update their profile details with validation and API mutation.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Displays eligible bookings and lets hotel staff mark stays as completed via a mutation call.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages creation and editing of hotel rooms, including image uploads, pricing, and room details.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows hotel subscription and activation status with conditional admin contact instructions.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with top navigation, content area, and footer.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Simple language selector component currently supporting only English.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar handling authentication, role-based links, and navigation visibility.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Displays admin contact info and payment methods for hotel activation or subscription issues.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods or fallback contact options, with support for WhatsApp and email links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence through a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for calling backend APIs, including user roles, profiles, hotels, and invite token operations.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles client-side room image uploads by converting files to data URLs with progress tracking.",
  "frontend/src/i18n/LocaleContext.tsx": "Simple locale context storing the selected language in localStorage and exposing setter functions.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and rendering the main App component.",
  "frontend/src/pages/AccountStatusPage.tsx": "Handles user identity, role, hotel activation state, and invite token validation/consumption, providing actions like refresh, copy, and admin elevation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Displays the admin dashboard with panels for invite tokens, hotel visibility, and booking management.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and displays a list of available hotels with basic info and navigation to detail pages.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest account overview and booking list with navigation to browse hotels and view account status.",
  "frontend/src/pages/HotelAreaPage.tsx": "Provides hotel owners with tabbed management views for profile, rooms, payments, bookings, stays, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Loads and displays a single hotel’s details and rooms, with booking flow, error handling, and user profile checks.",
  "frontend/src/pages/MainMenuPage.tsx": "Presents the main entry menu with guest and hotel portals, dynamically adjusting access based on role and activation.",
  "frontend/src/utils/debugFlags.ts": "Enables debug mode based on dev environment or a URL parameter.",
  "frontend/src/utils/money.ts": "Provides currency symbols, names, support checks, and money formatting with thousand separators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based param cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Tracks project state, requirements, issues, and feature requests for fixing room upload persistence and visibility."
}