{
  "backend/main.mo": "Defines core types, storage maps, and authorization/invite mixins for the booking canister, including hotels, rooms, bookings, payments, and user profiles.",
  "feature_evidence.json": "Feature evidence report linking the build-version update requirement to the file frontend/src/buildInfo.ts with metadata for components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including routing, hooks, UI components, and build info.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes with shared base styles.",
  "frontend/index.html": "Base HTML entry document setting metadata, favicon, and bootstrapping the React app.",
  "frontend/REGRESSION_CHECKLIST.md": "Regression checklist covering authentication, role behavior, rooms, bookings, and other critical flows for frontend releases.",
  "frontend/src/App.tsx": "Main React app entry configuring TanStack Router, React Query, localization provider, and protected routes.",
  "frontend/src/buildInfo.ts": "Exports the build version constant set to 'v27'.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Admin UI component displaying all bookings in a table with loading state, status badges, totals, and booking detail dialogs.",
  "frontend/src/components/admin/HotelVisibilityPanel.tsx": "Admin panel listing hotels with controls to toggle active status and update subscription state.",
  "frontend/src/components/admin/InviteTokensPanel.tsx": "UI for generating, validating, and listing invite tokens bound to hotel principals.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays access‑denied messaging with role requirements and optional hotel activation flow.",
  "frontend/src/components/auth/GuardErrorScreen.tsx": "Error screen for permission‑guard failures with retry and navigation options.",
  "frontend/src/components/auth/HotelActivationForm.tsx": "Form to validate and consume invite tokens to activate a hotel account.",
  "frontend/src/components/auth/ProfileCompletionGate.tsx": "Blocks access until an authenticated user completes a minimal profile form.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper enforcing Internet Identity login before rendering protected content.",
  "frontend/src/components/auth/RequireRole.tsx": "Checks user role, admin status, and hotel activation before rendering children or showing access or error screens.",
  "frontend/src/components/booking/BookingDetailsDialog.tsx": "Displays booking details in a dialog with status, dates, pricing, optional guest principal, and payment proof info.",
  "frontend/src/components/booking/BookingForm.tsx": "Provides a form for users to create a room booking, validating dates and guests before submitting.",
  "frontend/src/components/booking/BookingStatusBadge.tsx": "Renders a badge showing a booking's status with a variant and label based on the status value.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Shows a modal dialog containing an image preview with a close button and optional title.",
  "frontend/src/components/debug/AuthDiagnosticsPanel.tsx": "Displays authentication diagnostics including principal ID, role, admin status, and hotel activation state.",
  "frontend/src/components/hotel/HotelBookingsPanel.tsx": "Shows a table of hotel bookings with details, statuses, and access to the booking details dialog.",
  "frontend/src/components/hotel/HotelPaymentMethodsPanel.tsx": "Manages hotel payment methods, allowing adding and removing methods and showing current entries.",
  "frontend/src/components/hotel/HotelProfilePanel.tsx": "Form panel for viewing and updating hotel profile details including name, location, address, map link, WhatsApp, and email with validation.",
  "frontend/src/components/hotel/RecordStayPanel.tsx": "Displays eligible bookings and allows hotel staff to mark stays as completed.",
  "frontend/src/components/hotel/RoomPhotosSection.tsx": "Renders room photos with fallback handling and supports both full and compact gallery layouts.",
  "frontend/src/components/hotel/RoomsPanel.tsx": "Manages hotel rooms with create/edit dialogs, image uploads, and a table listing existing rooms.",
  "frontend/src/components/hotel/SubscriptionPanel.tsx": "Shows hotel subscription and activation status with contextual alerts and payment guidance.",
  "frontend/src/components/layout/AppShell.tsx": "Application layout wrapper providing navigation, main content area, and footer with build info.",
  "frontend/src/components/nav/LanguageSelector.tsx": "Simple locale selector allowing switching between supported languages (currently English only).",
  "frontend/src/components/nav/TopNav.tsx": "Navigation bar showing links based on authentication, role, and hotel profile, with login/logout and language selection.",
  "frontend/src/components/payments/ContactPaymentInstructions.tsx": "Card showing admin contact and payment options for hotel activation and subscription scenarios.",
  "frontend/src/components/payments/HotelPaymentMethodsList.tsx": "Displays a hotel's payment methods and provides WhatsApp/email contact buttons for guests.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, and stored identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user roles, profiles, admin status, and invite tokens via the actor.",
  "frontend/src/hooks/useRoomImageUpload.ts": "Handles reading image files as data URLs with simulated progress tracking for uploads.",
  "frontend/src/i18n/LocaleContext.tsx": "Provides a simple locale context storing and retrieving the current language from localStorage.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies base styling to body and borders.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountStatusPage.tsx": "Displays user authentication status, roles, hotel profile info, and supports invite token validation, consumption, and admin elevation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Provides the admin dashboard with panels for managing invite tokens, hotel visibility, and bookings.",
  "frontend/src/pages/BrowseHotelsPage.tsx": "Fetches and displays a grid of hotels with image previews and navigation to hotel detail pages.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows a guest’s account overview and booking history with actions to browse hotels or view booking details.",
  "frontend/src/pages/HotelAreaPage.tsx": "Loads the current user's hotel profile and presents management tabs for profile, rooms, payments, bookings, stays, and subscription.",
  "frontend/src/pages/HotelDetailPage.tsx": "Shows full details for a selected hotel, including address, photos, rooms, payment methods, and booking form.",
  "frontend/src/pages/MainMenuPage.tsx": "React page rendering the main menu with guest and hotel portal actions, using user role and hotel activation data to decide navigation.",
  "frontend/src/types/extended-backend.ts": "TypeScript definitions mirroring backend Motoko types, including hotel, room, booking, profile, and API interface structures.",
  "frontend/src/utils/debugFlags.ts": "Utility enabling debug mode based on environment or a debug URL parameter.",
  "frontend/src/utils/money.ts": "Money formatting helpers with currency symbols, names, supported codes, and formatting utilities.",
  "frontend/src/utils/roomPictures.ts": "Utilities for validating, filtering, and tracking room picture URLs, including failed image handling.",
  "frontend/src/utils/urlParams.ts": "Functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and plugins.",
  "project_state.json": "Metadata describing the project’s goal to fully restore backend and frontend to Version 27, including feature and migration requirements."
}