{
  "kind": "build_request",
  "title": "Clean up legacy room photos and undeletable payment method entries without affecting existing flows",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Add an admin-only backend maintenance API to permanently remove legacy/stale hotel data that is still visible in Guest/Admin browsing but should no longer appear anywhere, without changing normal product behavior for other hotels.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "tapi itu masih ada sisa-sisa sampah di backend yang bekas lama dan masih terbawa. Bisa anda bersihkan? supaya tidak tampil di akun tamu, akun admin dan di akun hotel?"
        ]
      },
      "acceptanceCriteria": [
        "A new admin-only method exists in `backend/main.mo` that can be invoked to clean legacy data for a specific hotel (input: hotel principal).",
        "The method is protected so only an admin (hardcoded admin or AccessControl admin) can call it; non-admin callers are rejected.",
        "No existing public/guest/hotel workflows are changed by default; cleanup happens only when the admin explicitly calls the new maintenance method.",
        "The canister still compiles and deploys with the single-actor architecture (all logic in `backend/main.mo`)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "When the admin maintenance API is run for the affected hotel, delete the legacy room photo data (reported ~5 old room photos) so those images no longer appear in Guest Browse Hotels, Admin hotel browsing, or the Hotel Detail room cards.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "di  aku tamu dan akun admin di fitur browsing hotel masih ada sampah foto-foto kamar yang dulu yang masih tampil tapi di akun hotel tidak ada.",
          "seluruh foto kamar yang lama di hapus. Kalau tidak ada salah ada 5 foto kamar yang lama. hapus. saja."
        ]
      },
      "acceptanceCriteria": [
        "After running the maintenance API for the target hotel, `getHotels()` and `getRooms({ hotelId = targetHotel })` do not return the legacy room photo URLs/data that previously appeared in Guest/Admin browsing screenshots.",
        "The cleanup removes legacy photo references at the source of truth (room records / stored image references) rather than relying on frontend filtering.",
        "Current/non-legacy room photos for that hotel remain intact unless they are part of the identified legacy set.",
        "No other hotel’s rooms/photos are modified by this cleanup."
      ]
    },
    {
      "id": "REQ-34",
      "text": "When the admin maintenance API is run for the affected hotel, remove the legacy payment method entries that cannot be deleted (including the 'GOPAY' entry and the old email stored as a payment method), and ensure they do not reappear.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "di metode pembayaran itu ada gopay dan email  lama yang tidak bisa di hapus. Saya ingin hapus dan mengganti metode pembayaran yang baru.",
          "Cukup di fitur profile. Ini saya kirim screenshot nya biar anda bisa lihat. Dan di fitur jangan di ganggu, karena sudah berjalan normal. Cukup di metode pembayaran saja yang ada teks GOPAY  di hapus."
        ]
      },
      "acceptanceCriteria": [
        "After running the maintenance API for the target hotel, `getCallerHotelProfile()` and `getHotels()` show the hotel with payment methods that no longer include the legacy 'GOPAY' entry or the old email-as-payment-method entry.",
        "The cleanup is persistent (data is actually removed from backend state).",
        "The hotel can still add new payment methods via the existing add method flow after cleanup (no method is auto-added by the cleanup).",
        "No other hotel’s payment methods are modified by this cleanup."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Ensure the hotel email is only represented via the hotel profile contact email field and not duplicated/derived into payment methods during reads or writes, so guests/admins do not see email displayed as a payment method.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Dan untuk email sudah ada kolom nya di fitur profile jadi tidak usah ada lagi di metode pembayaran. Cukup di fitur profile."
        ]
      },
      "acceptanceCriteria": [
        "Backend does not automatically add or retain payment method entries that are only an email address when the hotel already has `contact.email` set.",
        "`getHotels()` and `getCallerHotelProfile()` continue to expose `contact.email` as before, but do not include email-only entries in `paymentMethods` for the cleaned hotel.",
        "No changes break the existing frontend payment methods UI (add/remove continues to work as before)."
      ]
    }
  ],
  "constraints": [
    "Do not modify or break existing features that are currently working (bookings, cancellation flows, hotel profile, rooms management, admin panels, auth).",
    "Backend must remain a single-actor Motoko canister; keep all logic in `backend/main.mo`.",
    "All user-facing text must remain in English."
  ],
  "nonGoals": [
    "Adding a new UI for cleanup actions in guest/admin/hotel portals.",
    "Introducing new authentication providers or any external database/services.",
    "Changing booking/payment business logic beyond removing the specified legacy/stale data."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}