{
  "kind": "build_request",
  "title": "Fix booking total price calculation and show hotel-specific payment/contact info with subscription controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Compute and persist booking total price on the backend using the room’s stored nightly rate × number of nights derived from check-in/check-out, and do not trust any client-supplied totalPrice.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tinggal harga kamar yang belum benar, Hotel posting harga kamar Rp. 500.000 tapi kenapa masuk ke bookingan harga jadi Ro. 100."
        ]
      },
      "acceptanceCriteria": [
        "When createBooking is called, the backend loads the Room by roomId and calculates nights from (checkOut - checkIn), then sets BookingRequest.totalPrice = room.pricePerNight * nights.",
        "If the frontend submits an incorrect totalPrice (e.g., 100), the stored booking.totalPrice still matches the backend calculation.",
        "Backend rejects bookings where checkOut <= checkIn (no negative/zero-length stays) with a clear trap message.",
        "BookingRequest.currency is set from the room currency (or validated to match), so stored currency cannot be spoofed by the client."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend hotel profile data to store hotel-specific guest contact details (WhatsApp number and email) and expose them in hotel queries used by guests.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...termasuk nomor whatsapp dan email nya. Harusnya punya hotel yang tampil.",
          "Hotel punya mtode pembayaran masing-masing, bukan punya admin."
        ]
      },
      "acceptanceCriteria": [
        "Backend HotelData/HotelDataView includes fields for hotel WhatsApp and hotel email (optional fields are acceptable if not provided).",
        "Hotel owners can view and update these contact fields from the hotel dashboard (profile area).",
        "Guest-facing hotel data returned from getHotels includes the hotel contact fields so the frontend can render them without hardcoding admin info.",
        "No admin contact details are shown anywhere in guest booking/payment flows."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update guest booking/payment UI to display the selected hotel’s payment methods and the hotel’s own WhatsApp/email as the payment contact information (not the admin activation contact card).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...yang muncul malah yang punya admin, termasuk nomor whatsapp dan email nya. Harusnya punya hotel yang tampil."
        ]
      },
      "acceptanceCriteria": [
        "On the guest-facing hotel detail/booking flow, payment instructions display the hotel’s own WhatsApp number and email (if provided) and the hotel’s paymentMethods list.",
        "The existing admin-only activation contact card (frontend/src/components/payments/ContactPaymentInstructions.tsx) remains used only for hotel activation/subscription scenarios (e.g., inactive hotel owner subscription page) and is not reused for guest payment instructions.",
        "If a hotel has no payment methods, the guest UI clearly indicates that the hotel has not provided payment methods yet (without showing admin activation contacts)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add subscription billing status controls so admins can mark hotels as Paid/Unpaid and optionally mark hotels as TEST, and enforce visibility/booking rules based on these flags.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin bisa non aktifkan akun hotel nya. Ini saya lihat kan seperti apa untuk admin yang bisa aktifkan atau non aktifkan akun hotel"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores per-hotel subscription status (Paid/Unpaid) and (if required by current UI) a TEST flag.",
        "Non-admin getHotels only returns hotels that are Active AND Paid AND not TEST.",
        "Backend createBooking rejects bookings for hotels that are inactive, unpaid, or marked TEST (with clear trap messages).",
        "Admin UI provides controls to toggle Active/Inactive, mark Paid/Unpaid, and mark/unmark TEST; the hotel list visually reflects these states."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add conditional state migration for existing persisted hotel data to include new hotel contact fields and new subscription fields without breaking existing deployments.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "backend/migration.mo is updated (conditional migration policy) to populate new fields with safe defaults for existing hotels (e.g., empty/none contact fields, Paid=true/false per chosen default, TEST=false).",
        "After upgrade, existing hotels and bookings remain readable and functional, and admin/hotel dashboards load without traps caused by missing fields."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (compose instead of modifying immutable paths).",
    "Use English for any user-facing text in the UI."
  ],
  "nonGoals": [
    "Implementing external payment gateways or automatic payment verification.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time chat or messaging features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "English UI text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}