{
  "kind": "build_request",
  "title": "Restore validated hotel account: show Hotel Area menu + Hotel Management dashboard (match screenshot)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the hotel activation flow so that after an invite token is consumed, the authenticated hotel account becomes 'activated' and can load its hotel profile successfully (so the app treats the account as an activated hotel and shows the Hotel Management dashboard).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "fokus ke akun hotel, setelah di validasi, dashboard hotel tidak ada dan fitur Hotel area juga tidak ada di akun hotel."
        ]
      },
      "acceptanceCriteria": [
        "After calling the existing frontend flow that consumes an invite token, subsequent calls to the backend method used by the frontend to fetch the caller's hotel profile return a non-null hotel profile for that principal.",
        "The activation state persists across refresh/re-login.",
        "Consuming an invite token for activation does not only increment token usage; it results in an activated hotel account state that the frontend can detect."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend exposes and/or restores all API methods that the current frontend uses for hotel activation and hotel-area gating (including role/admin checks and caller hotel profile retrieval), and that these methods do not trap for valid callers in expected flows.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "setelah di validasi, dashboard hotel tidak ada dan fitur Hotel area juga tidak ada di akun hotel."
        ]
      },
      "acceptanceCriteria": [
        "Frontend React Query hooks for: (a) get caller role, (b) is caller admin, and (c) get caller hotel profile can all execute without runtime 'method not found' or unexpected traps in normal use.",
        "A non-admin hotel user can load their own hotel profile after activation; a guest cannot load a hotel profile (frontend should receive null/denied behavior consistent with current guard handling)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the Hotel Area navigation entry visible for validated hotel accounts, matching the screenshot behavior: when logged in as an activated hotel user, show the 'Hotel Area' link in the top navigation and allow navigation to /hotel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "fitur hotel area di akun hotel. lihat screnshot",
          "iya persis seperti screenshot kedua."
        ]
      },
      "acceptanceCriteria": [
        "When authenticated as an activated hotel account, the TopNav displays a 'Hotel Area' link.",
        "Clicking 'Hotel Area' navigates to /hotel and renders the hotel management view.",
        "When authenticated as a non-activated hotel account, the TopNav does not show 'Hotel Area' (unless admin), consistent with existing access rules."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the Hotel Management dashboard UI for hotel accounts matches the second uploaded screenshot: header 'Hotel Management' with description text and a tabbed interface with tabs in this order: Profile, Rooms, Payments, Bookings, Record Stays, Subscription; Rooms tab must support adding rooms and uploading room photos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "harus ada dashboard hotel seperti screnshot... termasuk upload foto kamar.",
          "iya persis seperti screenshot kedua."
        ]
      },
      "acceptanceCriteria": [
        "/hotel renders the HotelAreaPage tab layout with the 6 tabs in the same labels and order as the screenshot: Profile, Rooms, Payments, Bookings, Record Stays, Subscription.",
        "The Rooms tab allows creating a room and uploading at least one room photo using the existing upload flow (no broken image/failed save in normal use).",
        "If hotel profile loading is in progress, a loading state is shown; if hotel profile is missing, a clear error card is shown (existing behavior is acceptable)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "After successful hotel validation/activation via invite token consumption, automatically refresh relevant cached queries and redirect the user into the Hotel Management dashboard so the change is immediately visible without manual refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "setelah di validasi, dashboard hotel tidak ada dan fitur Hotel area juga tidak ada di akun hotel."
        ]
      },
      "acceptanceCriteria": [
        "After consuming a valid invite token, the UI invalidates/refetches role/admin/hotel-profile queries and redirects to /hotel.",
        "Immediately after redirect, the HotelAreaPage does not show 'Hotel Profile Not Found' for the newly activated hotel user.",
        "After redirect, the TopNav shows 'Hotel Area' for the activated hotel user."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if an actual stable-state migration is required.",
    "Do not edit any files under frontend/src/components/ui or any other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Use English for any user-facing text changed/added as part of this build request."
  ],
  "nonGoals": [
    "Redesigning the overall site theme or layout beyond making the hotel dashboard/Hotel Area match the provided screenshot behavior.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or non-IC backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}