{
  "kind": "build_request",
  "title": "Restore entire codebase to Version 27 (backend + frontend)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the application code to match Version 27 exactly by reverting/recovering all backend and frontend files to their Version 27 contents, including restoring any missing role-based pages/panels (Guest/Hotel/Admin) and any backend APIs those UI flows depend on.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-restore-v27"
        ],
        "quotes": [
          "kembalikan semua file versi 27"
        ]
      },
      "acceptanceCriteria": [
        "All routes and role-gated areas that were present in Version 27 are available again (Guest, Hotel Area, Admin Panel) and behave consistently with the Version 27 behavior.",
        "No Version 27 files listed by the user are missing from the restored project.",
        "The restored app compiles successfully (frontend build + Motoko canister build) with no runtime crashes on initial navigation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the displayed build identifier so the UI clearly indicates Version 27 (e.g., the footer build string sourced from frontend/src/buildInfo.ts must reflect Version 27).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-restore-v27"
        ],
        "quotes": [
          "kembalikan semua file versi 27"
        ]
      },
      "acceptanceCriteria": [
        "The footer build label shows a Version 27 identifier (not the current 'v24-restored')."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the restored Version 27 backend schema/state layout differs from the currently deployed state, implement a safe, conditional canister upgrade migration (backend/migration.mo) so existing production data remains readable and the canister can upgrade without trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-restore-v27"
        ],
        "quotes": [
          "kembalikan semua file versi 27"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister from the current deployed version to the restored Version 27 does not trap.",
        "Previously stored hotels/rooms/bookings/profiles (if any exist in stable memory) remain accessible after upgrade."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Run and pass the existing frontend regression checklist (frontend/REGRESSION_CHECKLIST.md) against the restored Version 27 build, focusing on authentication/authorization, role-based navigation visibility, Guest/Hotel/Admin panels, booking flows, and Admin invite token generation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-restore-v27"
        ],
        "quotes": [
          "kembalikan semua file versi 27"
        ]
      },
      "acceptanceCriteria": [
        "All checklist items related to role-based navigation and access control pass (Admin can access /admin, Hotel can access /hotel when activated, Guest is denied for /admin and /hotel).",
        "Admin invite token generation succeeds and the token list refreshes without showing a FAILED state.",
        "Guest and Hotel booking views show expected booking data without missing menus/pages."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify any frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose shadcn/ui components rather than editing them).",
    "Use English for any user-facing text changed/added as part of the restoration."
  ],
  "nonGoals": [
    "Implementing new features beyond what existed in Version 27.",
    "Redesigning the UI/visual theme beyond what is required to restore Version 27.",
    "Adding third-party authentication methods other than Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}