{
  "kind": "build_request",
  "title": "Rollback Version 25 regression by restoring Version 24 role-based access (Admin/Hotel/Guest) and panels",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the application behavior to match Version 24 by fixing the Version 25 regression where Admin and Hotel accounts are treated as Guest accounts, causing the Admin Panel (/admin) and Hotel Area (/hotel) to disappear or become inaccessible.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-ini-kenapa",
          "msg-user-iya-v24"
        ],
        "quotes": [
          "ini kenapa sekarang malah semua hilang baik di akun admin, akun hotel dan akun tamu. akun admin jadi berubah jadi akun tamu dan hilang panel admin nya., akun hotel berubah jadi akun tamu dan Hotel Area malah ikut hilang juga.",
          "IYA VERSI 24"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with an Admin principal that previously had admin access in Version 24, navigating to /admin shows the Admin Panel UI (not AccessDenied) and the TopNav includes the expected admin navigation.",
        "When logged in with a Hotel owner principal that previously had hotel access in Version 24, navigating to /hotel shows the Hotel Management dashboard and tabs (Profile, Rooms, Payments, Bookings, Record Stays, Subscription).",
        "When logged in with a Guest principal, /admin and /hotel remain protected and show an appropriate access denied screen (no privilege escalation).",
        "No account type (admin/hotel/guest) is unintentionally downgraded to Guest due to frontend caching or backend role checks."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure backend authorization and role detection APIs used by the frontend (e.g., user role and admin checks) return correct results consistent with Version 24, and do not reset or corrupt existing role/authorization state during upgrade/deploy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-ini-kenapa",
          "msg-user-perbaiki"
        ],
        "quotes": [
          "akun admin jadi berubah jadi akun tamu dan hilang panel admin nya., akun hotel berubah jadi akun tamu dan Hotel Area malah ikut hilang juga.",
          "PERBAIKI SEKARANG"
        ]
      },
      "acceptanceCriteria": [
        "Backend role/admin checks correctly identify Admin principals as admin and Hotel principals as hotel owners as they were in Version 24.",
        "Upgrading/deploying the backend does not wipe or reinitialize authorization state for existing principals.",
        "Hotel activation/ownership checks do not block legitimate hotel owners from accessing their hotel profile."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend build/version identifier so production clearly reflects the rollback to Version 24 (for verification and support), and ensure user-facing text remains in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-iya-v24"
        ],
        "quotes": [
          "IYA VERSI 24"
        ]
      },
      "acceptanceCriteria": [
        "The app exposes a visible or inspectable build identifier indicating Version 24 is running (e.g., via the existing build version constant).",
        "All user-facing messages related to auth/role/access continue to be English (no regressions to non-English UI strings)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Run and pass the existing regression checks specifically for Authentication & Authorization, Admin Panel access, and Hotel Area access after the Version 24 rollback behavior is restored.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-ini-kenapa",
          "msg-user-iya-v24"
        ],
        "quotes": [
          "akun admin jadi berubah jadi akun tamu dan hilang panel admin nya., akun hotel berubah jadi akun tamu dan Hotel Area malah ikut hilang juga.",
          "IYA VERSI 24"
        ]
      },
      "acceptanceCriteria": [
        "All checklist items under 'Authentication & Authorization' in frontend/REGRESSION_CHECKLIST.md pass.",
        "Admin Panel checklist items (Invite token generation, hotel visibility controls, admin booking visibility) are accessible to Admin users only.",
        "Hotel Management access works for activated hotel owners and remains inaccessible to guests."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is required to preserve existing principals/roles.",
    "Do not modify files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement or change room photo upload/display behavior as part of this rollback request (focus only on restoring Version 24 role/panel behavior).",
    "Do not add new features unrelated to fixing the Version 25 authorization/role regression."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}