{
  "kind": "build_request",
  "title": "Admin purge of all data for a specific hotel Principal ID and enforce re-registration + activation",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend admin-only API to fully purge (hard-delete) all data associated with the hotel Principal ID `opo7v-ka45k-pk32j-76qsi-o3ngz-e6tgc-755di-t2vx3-t2ugj-qnpbc-gae` without affecting any other principals’ data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "sekarang begini saja semua yang menyangkut principle id (opo7v-ka45k-pk32j-76qsi-o3ngz-e6tgc-755di-t2vx3-t2ugj_qnpbc-gae) hapus total. dari sistem ini.",
          "Buat akun hotel tidak bisa lagi mempunyai akses ke dashboard hotel keculi melakukan aktivasi lagi admin.",
          "Buay kosong saja semua database dari principle id yang saja kasih"
        ]
      },
      "acceptanceCriteria": [
        "Calling the purge API as an admin removes the hotel profile entry for the target principal from backend storage.",
        "All rooms belonging to the target principal are deleted from backend room storage and no longer appear in any guest/admin/hotel queries.",
        "All hotel-owned payment methods and contact data for the target principal are removed (by virtue of deleting the hotel record).",
        "All activation/ownership mappings for the target principal are removed (e.g., direct activation flags and owner mappings).",
        "All invite tokens that are bound to the target principal (and/or used to activate that principal) are removed/invalidated so they cannot re-activate the old account.",
        "Any bookings/payments that reference the target hotel principal are deleted or made inaccessible such that no UI path can render them as valid data (no orphan/ghost records returned from queries).",
        "The purge operation does not delete or modify hotels/rooms/bookings belonging to any other principal IDs.",
        "The purge API is protected by the same admin authorization used by existing admin methods (non-admin callers receive an authorization error)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure hotel dashboard access is blocked after a purge until the hotel re-registers and is activated again by admin invite token consumption.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "ketika hotel belum melakukan aktivasi ke admin, dashboard hotel tidak bisa di akses, kecuali sudah melakukan aktivasi ke andmin",
          "hotel harus daftar ulang yang di lakukan hotel itu sendiri."
        ]
      },
      "acceptanceCriteria": [
        "After the purge, logging in as the purged hotel principal cannot access Hotel Area routes; the user is shown the existing Access Denied flow requiring activation.",
        "After the purge, the purged principal is not considered “activated” by backend logic (activation checks return false).",
        "After admin generates a NEW invite token for the same principal and the hotel consumes it, the hotel can access Hotel Area again and can create a new hotel profile (re-registration).",
        "Existing guest flows (browse hotels, view hotel detail, create booking, view my bookings) continue to function for other hotels without errors."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an Admin Panel UI action to run the full principal purge safely (with explicit confirmation) and refresh affected cached queries so the UI immediately reflects the deletion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-10"
        ],
        "quotes": [
          "hapus total saja.",
          "build sekarang dan jangan sampai error dan mengganggu fitur-fitur yang lain ayang sudah berjalan."
        ]
      },
      "acceptanceCriteria": [
        "Admin UI provides an input for a hotel Principal ID and a destructive purge button that requires a clear confirmation step (e.g., typing the principal or a confirmation phrase) before executing.",
        "On success, the UI invalidates/refetches relevant React Query caches (at minimum hotels list, invite tokens list, admin bookings views, and any hotel-profile queries) so removed data disappears without requiring a hard refresh.",
        "On failure, the UI shows a user-friendly error message and does not crash the app.",
        "Non-admin users cannot see or use the purge UI (consistent with existing admin route/role gating)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add regression checks and guardrails to prevent runtime errors or cross-feature breakage after introducing purge behavior.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "jangan sampai error dan mengganggu fitur-fitur yang lain ayang sudah berjalan."
        ]
      },
      "acceptanceCriteria": [
        "Guest Browse Hotels page renders successfully after purge and does not show placeholder/ghost rooms for any hotel.",
        "Admin Invite Tokens panel renders and works after purge (can still generate/copy tokens for other principals).",
        "Hotel activation flow still works end-to-end for a new hotel principal (admin creates token → hotel consumes → hotel can access Hotel Area).",
        "No infinite loading states are introduced in role/activation guards (RequireRole continues to show loading/error/denied states correctly)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "The purge must be strictly scoped to the specified principal ID and must not impact unrelated hotels, bookings, rooms, tokens, or users.",
    "All user-facing text introduced/changed by this build must be in English."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity remains).",
    "Implementing external database backups/restore tooling.",
    "Building real-time updates (WebSockets) or notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User prefers English for user-facing text in build artifacts/specs."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}