{
  "kind": "build_request",
  "title": "Fix room photo persistence and visibility for Hotel and Guest accounts",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend room retrieval so the same room records (including the full `pictures : [Text]` array) are returned consistently for Admin, the owning Hotel account, and Guests. Rooms that appear for Admin must not disappear or lose their `pictures` data when viewed by the owning Hotel account or by Guests browsing a hotel.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "we already several deploy but still not showing room photos on guest and hotel account. While in admin it exists.",
          "Pokok nya apa yang di upload di akun hotel harus sama persis yang tampil di akun admin dan akun tamu"
        ]
      },
      "acceptanceCriteria": [
        "Given a hotel with rooms saved with `pictures` populated, calling the existing backend room listing/query method(s) as Admin returns rooms with non-empty `pictures`.",
        "Calling the same room listing/query method(s) as the owning Hotel principal returns the same rooms and the same `pictures` values (order preserved).",
        "Calling the same room listing/query method(s) as a Guest principal (with any current visibility/subscription rules applied) returns rooms with the same `pictures` values for hotels/rooms that are visible to Guests.",
        "No role-based logic silently strips `pictures` or returns an empty room list for the owning Hotel when rooms exist."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend room create/update persistence so when the Hotel account saves a room with `pictures`, the stored room record retains the provided `pictures` list and remains associated with the correct `hotelId` for all subsequent reads (Admin/Hotel/Guest).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "what is uploaded in the hotel account must be exactly the same as what appears in the admin account and the guest account"
        ]
      },
      "acceptanceCriteria": [
        "Creating a room as a Hotel account with a non-empty `pictures` array persists those exact strings in backend state.",
        "Updating an existing room as the owning Hotel account persists the updated `pictures` array and does not clear pictures unintentionally.",
        "After create/update, subsequent reads via existing queries used by Admin, Hotel Area, and Guest Hotel Detail return the persisted `pictures` values."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Hotel Area Rooms UI to clearly differentiate between (a) genuinely empty room results and (b) backend fetch failures or filtered/unauthorized results, so Hotel owners are not shown a misleading “No rooms yet” state when the backend call failed or returned unexpected filtered results that hide existing rooms/photos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "we already several deploy but still not showing room photos on guest and hotel account. While in admin it exists."
        ]
      },
      "acceptanceCriteria": [
        "If the rooms query fails, show an explicit error state (not the empty-state message) with a retry option.",
        "If rooms exist but pictures are missing/empty, the UI should still show the room entry and a clear photos count (0) without hiding the room.",
        "The empty-state message (“No rooms yet...”) is only shown when the rooms query succeeds and returns an empty array for the hotel owner."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the guest-facing Hotel Detail page renders room photos reliably using the returned `pictures` strings, and provide a safe fallback UI when rooms exist but a room has zero valid pictures so guests can still browse and book.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still not showing room photos on guest account"
        ]
      },
      "acceptanceCriteria": [
        "On Hotel Detail, each room displays its photos when `pictures` contains valid image strings.",
        "If `pictures` is empty or contains only invalid/unloadable strings, show a consistent fallback state (e.g., “No photos available for this room”) while keeping the rest of the room card and booking actions available.",
        "Photo rendering logic accepts the same `pictures` formats produced by the Hotel upload flow (currently data URLs)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify any frontend files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing UI text added or changed."
  ],
  "nonGoals": [
    "Adding third-party image hosting/CDN integrations.",
    "Adding new authentication providers beyond Internet Identity.",
    "Redesigning unrelated booking/payment/admin features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}