{
  "kind": "build_request",
  "title": "Show uploaded room photos in Hotel account and Guest Browse Hotels (with zoom)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend room/room-photo visibility so Hotel owners and Guests can fetch rooms (including the `pictures` array) and see the same room photo data that is currently visible in the Admin UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "YA KERJAKAN DAN DI AKUN HOTEL JUGA HARUS TAMPIL SEMUA U=FOTO KAMAR YAMG SUDAH DI UPLOAD,"
        ]
      },
      "acceptanceCriteria": [
        "Calling the rooms listing query for a given hotel (guest flow) returns each room with its `pictures` array intact (no empty array unless truly no photos).",
        "Calling the hotel-owner rooms listing (hotel dashboard flow) returns the hotel’s rooms with `pictures` intact.",
        "The backend does not expose any new write operations for guests; it only ensures correct read visibility for rooms/photos."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Hotel account (Hotel Area → Rooms), render all previously uploaded room photos for each existing room, and ensure the hotel owner can add and remove photos when creating/editing a room.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "DI AKUN HOTEL JUGA HARUS TAMPIL SEMUA U=FOTO KAMAR YAMG SUDAH DI UPLOAD,"
        ]
      },
      "acceptanceCriteria": [
        "Hotel Area → Rooms lists existing rooms (not an empty state when rooms exist).",
        "Each room row/card shows photo thumbnails using the existing `RoomPhotosSection` component (or equivalent consistent gallery UI).",
        "Clicking any thumbnail opens a zoom/preview modal using the existing `ImagePreviewDialog`.",
        "When editing a room, existing photos are shown and can be removed by the hotel owner, and newly uploaded photos are appended and saved."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the Guest account Browse Hotels page, display room photo thumbnails inside each hotel card (similar to Admin’s photo presentation), and allow click-to-zoom preview.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "DI AKUN TAMU DI FITUR BROWSER HOTEL SAMA SEPERTI DI AKUN ADMIN, FOTO KAMAR MUNCUL DI BOWSER HOTEL ."
        ]
      },
      "acceptanceCriteria": [
        "Browse Hotels cards show at least one representative room photo thumbnail when the hotel has rooms with photos (e.g., first available room’s first photo).",
        "If a hotel has no room photos, the card shows a clear ‘No photos available’ placeholder state (English text).",
        "Clicking a thumbnail opens the existing `ImagePreviewDialog` for zoom/preview.",
        "The page remains responsive and keeps existing navigation behavior (‘View Details & Book’ still works)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enforce role-based room photo UI permissions consistently: Hotel owners can add/remove photos via room create/edit; Guests are view-only and cannot see any edit/delete controls for room photos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "DI AKUN HOTEL DAN AKUN TAMU ANDA TIDAK KERJAKAN."
        ]
      },
      "acceptanceCriteria": [
        "Guest-facing pages (Browse Hotels, Hotel Detail) do not render any photo upload/remove/edit controls.",
        "Hotel Area renders upload/remove controls only where appropriate (room create/edit flows).",
        "No admin-only UI is required for this change; do not introduce admin edit/delete for room photos if the intended behavior is view-only there."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a consistent visual theme across the affected pages (Hotel Area Rooms, Browse Hotels, Hotel Detail) with a warm, hospitality-oriented style (neutral backgrounds + orange accents), keeping typography and spacing consistent and avoiding blue/purple as primary brand colors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "YA KERJAKAN"
        ]
      },
      "acceptanceCriteria": [
        "Browse Hotels and Hotel Area Rooms use consistent card layout, spacing, and thumbnail styling.",
        "Primary accents use warm/orange tones; blue/purple are not used as the main theme colors.",
        "All user-facing text introduced/changed by this work is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add `backend/migration.mo` if a state upgrade is required.",
    "Do not edit files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths`; compose existing UI components instead.",
    "Use React Query invalidation patterns already present in `frontend/src/hooks/useQueries.ts` after room create/update so photo changes appear immediately."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity is supported).",
    "Introducing external databases or third-party storage services for images.",
    "Changing booking/payment business logic beyond what is necessary to correctly display room photos."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}