{
  "kind": "build_request",
  "title": "Enable standard guest booking flow with cross-portal booking management and hotel-managed payment methods",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Replace the placeholder guest booking UI with a working standard hotel booking flow on the Hotel Detail page: guest selects a room, then can choose check-in date, check-out date, number of rooms, and number of guests, and submit a booking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "ya aktifka fitur booking nya. dan gunarkan alur standar hotel saja, bisa pilih kamar, jumlah kamar, jumlah orang dan tanggal booking."
        ]
      },
      "acceptanceCriteria": [
        "On `/browse/$hotelId`, after selecting a room, the booking form collects: check-in date, check-out date, number of rooms, and number of guests.",
        "Submitting the form creates a booking via the backend and shows a clear success state (e.g., booking ID and initial status).",
        "Validation prevents invalid input (e.g., check-out <= check-in; rooms/guests < 1).",
        "The previous 'Booking functionality coming soon/unavailable' placeholder messaging is no longer shown when booking is supported."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Implement backend booking APIs required by the frontend `ExtendedBackendInterface`: `createBooking(hotelId, roomId, checkIn, checkOut, guests, currency)`, `getBookings(filters)`, and `updateBookingStatus(bookingId, newStatus)` with correct authorization so bookings work for guest, hotel, and admin portals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "bookingan tamu harus masuk ke akun hotel dan akun admin juga. Dan Bookingan tamu setelah di konfirmasi pihak hotel, status nya harus confirm baik di akun tamu, akun admin dan akun hotel"
        ]
      },
      "acceptanceCriteria": [
        "A signed-in guest can create a booking for a selected hotel/room and receive a booking ID.",
        "`getBookings` returns the correct bookings depending on caller context: guest sees own bookings; hotel sees bookings for its hotel; admin can query across hotels.",
        "A hotel (owner) can confirm a booking by calling `updateBookingStatus` (mapped to an implemented status such as `#booked`), and the updated status is persisted and returned in subsequent queries.",
        "Unauthorized callers cannot update other hotels’ bookings (except admin)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Extend the booking data model to support 'number of rooms' (room quantity) and ensure `totalPrice` is computed based on nights × pricePerNight × roomQuantity (and persisted on the booking record).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "bisa pilih kamar, jumlah kamar, jumlah orang dan tanggal booking."
        ]
      },
      "acceptanceCriteria": [
        "Booking records persist a room quantity field (e.g., `roomsCount`) and it is returned from `getBookings`.",
        "`totalPrice` reflects nights × room price per night × roomsCount.",
        "If a schema/state change is required, a conditional `backend/migration.mo` update is provided to preserve existing state and initialize the new field safely."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Implement guest booking visibility in the Guest portal by replacing the placeholder 'My Bookings' UI with a real bookings table that loads from `getBookings`, shows status, dates, room quantity, guests, total price, and opens booking details using the existing booking details dialog where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "bookingan tamu harus masuk ke akun hotel dan akun admin juga."
        ]
      },
      "acceptanceCriteria": [
        "`/my-bookings` (or the existing My Bookings page) displays bookings for the logged-in guest using backend data.",
        "Each booking row shows at minimum: hotel, room, check-in/out, roomsCount, guests, totalPrice/currency, and status.",
        "Booking status updates (after hotel confirmation) are reflected for the guest after refresh/reload (and ideally via React Query invalidation)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Implement hotel-side booking management by replacing the placeholder Hotel Bookings panel with a list/table of bookings for the caller hotel, including an action to confirm a pending booking (calling `updateBookingStatus`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Dan Bookingan tamu setelah di konfirmasi pihak hotel, status nya harus confirm baik di akun tamu, akun admin dan akun hotel,"
        ]
      },
      "acceptanceCriteria": [
        "Hotel Area → Bookings tab shows bookings belonging to the caller hotel.",
        "Hotel can confirm a booking; after confirmation, the booking status is shown as confirmed (mapped to the backend status, e.g., `Booked`).",
        "After confirming, relevant queries are invalidated so the UI updates without manual intervention beyond a normal refresh."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Implement admin-side bookings overview by replacing the placeholder Admin Bookings panel with a real bookings list that can display bookings across all hotels (using `getBookings`), including status and key booking fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "bookingan tamu harus masuk ke akun hotel dan akun admin juga."
        ]
      },
      "acceptanceCriteria": [
        "Admin Panel → Bookings Overview shows bookings loaded from the backend.",
        "Admin can see bookings across hotels (not limited to a single hotel).",
        "Booking status displayed in admin matches guest/hotel views after confirmation."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Enable flexible hotel-managed payment methods: implement backend APIs `addPaymentMethod(name, details)` and `removePaymentMethod(index)` for activated hotels, persist them to the hotel profile, and expose them through existing hotel profile queries (e.g., `getHotels`, `getCallerHotelProfile`, `getHotelProfile`).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Jadi jangan di buat baku di dalam sistem, biar pihak oleh yang memasukan metode pembayaran. Admin tidak mengatur metode pembayara.n."
        ]
      },
      "acceptanceCriteria": [
        "Activated hotel caller can add a payment method (name + details) and it persists on their hotel record.",
        "Activated hotel caller can remove a payment method by index and it persists.",
        "`getHotels` and hotel profile queries return the updated `paymentMethods` list so guests can view it on the hotel detail page.",
        "Admin cannot edit/manage hotel payment methods via backend APIs (only the hotel owner, plus admin override only if already used elsewhere is explicitly intended)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Replace the placeholder Hotel Payment Methods panel UI with an operational management UI: add payment method (name, details), list existing methods, and remove method actions; do not hardcode payment providers or countries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Untuk metode pembayaran di buat simpel... Jadi jangan di buat baku di dalam sistem, biar pihak oleh yang memasukan metode pembayaran."
        ]
      },
      "acceptanceCriteria": [
        "Hotel Area → Payments tab allows adding payment methods (free-form name + details) and shows them immediately after save.",
        "Hotel can remove an existing payment method and the list updates accordingly.",
        "No fixed list of providers is enforced; fields accept arbitrary text."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Ensure hotel email entry is functional end-to-end: the Hotel Profile Save flow must persist the email field to the backend and reflect it in hotel profile reads and guest-facing contact sections where applicable.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Dan ini juga di akun Hotel belum bisa menambahkan metode pembayaraan, memasukan email hotel. Masih belum aktif."
        ]
      },
      "acceptanceCriteria": [
        "Saving hotel profile with an email updates the backend `contact.email` field.",
        "After saving, the Hotel Profile panel reloads and displays the saved email.",
        "Guest-facing hotel contact displays the email when present (no placeholder text)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add focused regression verification aligned with `frontend/REGRESSION_CHECKLIST.md` to confirm that enabling bookings and payment methods does not break existing flows (auth, browse hotels, hotel profile, rooms, admin hotel visibility).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "bangun sekarang, jangan sampe error dan mengganggu fitur yang lain."
        ]
      },
      "acceptanceCriteria": [
        "Document (in code comments or a short checklist update) the specific steps run to verify: hotel profile save, room create/update, guest hotel browsing, booking creation, booking confirmation, admin booking visibility, and payment methods management.",
        "No runtime errors like missing actor methods occur for booking/payment/room/profile flows after deployment."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add/update `backend/migration.mo` if a state/schema upgrade is required (conditional migration policy).",
    "Do not edit any frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`. Compose these components/hooks instead.",
    "Use English for all user-facing UI strings added/changed as part of this work.",
    "Do not introduce hardcoded payment providers (e.g., Stripe-only, GoPay-only); payment methods must be free-form per hotel.",
    "Do not break existing functionality in browsing hotels, hotel profile/rooms management, and admin hotel visibility tools."
  ],
  "nonGoals": [
    "Implementing real online payment processing (e.g., Stripe checkout) or automatic payment verification.",
    "Real-time notifications to hotel/admin/guest (no push, email, SMS, or websockets).",
    "Adding third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}