{
  "kind": "build_request",
  "title": "Retry build/deploy and force a fresh release version to recover missing Publish URL",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Force a fresh deployment attempt by bumping the frontend build version string, then run build + deploy so Caffeine attempts a new publish and shows the Publish URL / “Open App” link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "coba sekali lagi di build dan deploy. mudah-mudahan server caffeine sudah tidak error. dan bisa menampilam URL nya. tapi jika gagal kita tunda dulu sampe besok."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/buildInfo.ts` BUILD_VERSION is incremented from its current value to a new value (e.g., v33) to trigger a new build artifact.",
        "A new build+deploy is executed after the version bump.",
        "The resulting Caffeine deploy output includes a visible Publish URL / “Open App” link; if it is still missing, record the deploy attempt outcome for follow-up (error message or confirmation that deploy succeeded but URL did not appear)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a short admin-facing note in the app (Admin Panel) explaining that if the Caffeine platform UI fails to show the Publish URL / “Open App” after a successful deploy, it is a platform issue and the team will pause and retry later, without implying an application bug.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "tapi jika gagal kita tunda dulu sampe besok."
        ]
      },
      "acceptanceCriteria": [
        "Admin Panel contains a concise English notice about the potential Caffeine deploy UI issue (missing Publish URL / Open App) and the plan to retry later if it happens.",
        "The notice does not change any business logic and does not block normal app usage."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose instead).",
    "Do not change backend logic as part of this request; this is a deploy retry and release bump only."
  ],
  "nonGoals": [
    "Implementing the previously discussed admin feature to delete a room along with its metadata (photo + description/price/type) is out of scope for this build request.",
    "Fixing legacy room data/photo cleanup behavior is out of scope for this build request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}