{
  "kind": "build_request",
  "title": "Purge all room data (photos + details) for HOTEL DUMMY only and prevent ghost rooms after cleanup",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Implement an admin-only backend maintenance operation to purge **all room data** for a single specified hotel without affecting any other hotels. The purge must delete every room record belonging to the target hotel (including all fields such as room number/type/price/currency/pictures) and must also remove those room IDs from the hotel’s stored room list so the hotel ends up with **zero rooms**.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "foto dari satu hotel saja bukan semua hote. pokoknya semua foto berikut deskripsi kamar nya, harga nya, tipe nya. Ya anda reset saja semua database foto kamar berikut deskripsi kamar nya",
          "YA SUDAH ADA RESET DAN LAKUKAN PEMBERSIHAN DATABASE,"
        ]
      },
      "acceptanceCriteria": [
        "When the purge is executed for the target hotel, `getCallerHotelProfile()` and `getHotels()` return the hotel with an empty `rooms` array (length = 0).",
        "After purge, no room cards appear for the target hotel in Guest Browse Hotels and on the Hotel Detail page (the screenshot case must no longer show multiple rooms with 'No photos available' placeholders).",
        "No rooms are deleted/modified for any other hotel principals."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Make the cleanup for the specific hotel named **\"HOTEL DUMMY\"** run as part of a safe, one-time backend upgrade cleanup (so it does not require any manual admin UI actions). The upgrade cleanup must locate the hotel record by name match \"HOTEL DUMMY\" and then perform the full room purge described in REQ-41, and persist a flag so the purge is not re-run on every upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "HOTEK DUMMY",
          "HOTEL DUMMY",
          "YA SUDAH ADA RESET DAN LAKUKAN PEMBERSIHAN DATABASE,"
        ]
      },
      "acceptanceCriteria": [
        "After deploying the upgrade, \"HOTEL DUMMY\" has zero rooms in all portals without requiring an admin to run `adminRemoveLegacyRoomPhotos` per-room.",
        "The one-time cleanup is idempotent: subsequent upgrades do not repeatedly modify state once the purge has already been applied."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Prevent ghost/placeholder rooms from appearing when a hotel’s stored room ID list references missing room records. Update hotel-to-room view construction so that room IDs that do not exist in `roomsMap` are excluded from `rooms` results (do not synthesize empty rooms with blank fields).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ini ok foto kamar sudah terhapus tapi cuma foto doang, sedang deskripsi kamar tidak ikut terhapus, seperti tipe kamar, nama kamar dan lain-lain nya. Ini saya kirim screnshot nya supaya anda bisa melihat"
        ]
      },
      "acceptanceCriteria": [
        "If a hotel’s room list contains stale/orphan room IDs, `getCallerHotelProfile()`, `getHotelProfile(hotelId)`, and `getHotels()` do not return placeholder rooms with empty fields; they only return rooms that exist in `roomsMap`.",
        "The change does not break normal room display for hotels with valid room records."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add a targeted regression verification pass (manual is acceptable) to confirm the HOTEL DUMMY purge and ghost-room fix did not break unrelated flows, using the relevant portions of `frontend/REGRESSION_CHECKLIST.md` (auth, browse hotels, hotel profile, rooms, admin hotel visibility). Record results as a short checklist in the PR description or release notes.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "YA SUDAH ADA RESET DAN LAKUKAN PEMBERSIHAN DATABASE,"
        ]
      },
      "acceptanceCriteria": [
        "Guest Browse Hotels still loads and shows other active hotels correctly.",
        "Hotel Area → Rooms still works for a different (non-dummy) hotel: rooms can be created/updated and displayed.",
        "Admin panel still loads and hotel visibility toggles still work.",
        "HOTEL DUMMY no longer shows any rooms anywhere in the UI after the upgrade cleanup runs."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text introduced by this change.",
    "Backend must remain a single-actor Motoko canister (all logic in `backend/main.mo`).",
    "Do not edit files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "The purge must only affect the single hotel \"HOTEL DUMMY\"; do not delete data for other hotels."
  ],
  "nonGoals": [
    "Do not add new booking/payment features as part of this request.",
    "Do not redesign the UI; only ensure the data cleanup result is reflected correctly.",
    "Do not delete the entire HOTEL DUMMY hotel profile unless explicitly required; only reset/purge room data."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}