{
  "kind": "build_request",
  "title": "Fix room upload persistence and visibility for hotel and guest accounts",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend room create/update and room listing behavior so that rooms uploaded by a hotel account are persisted under the correct hotel principal and are retrievable by (a) the same hotel account in the hotel dashboard and (b) guests browsing the hotel detail page (not only admins). Ensure the room read path uses a single source of truth (roomsMap/hotelsMap) and that role-based filtering does not accidentally exclude the hotel owner or guests for the uploaded hotel.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still not showing on hotel account and guest account ... uploaded room data ... appears on admin",
          "after upload by hotel, it must be saved in hotel dashboard and visible to guests",
          "bangun sekarang dan jangan saampai ada masalah"
        ]
      },
      "acceptanceCriteria": [
        "After creating a room as a hotel owner, reloading the app still shows the room in Hotel Area > Rooms for that same hotel principal.",
        "As a guest, opening Browse Hotels > Hotel Detail for that hotel shows the uploaded room(s) in the 'Available Rooms' list.",
        "Admin, hotel owner, and guest views all reflect the same set of rooms for a given hotel (subject only to intentional visibility rules).",
        "Backend functions involved in creating/updating/listing rooms do not rely on admin-only paths to read room data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend hotel/room visibility rules so guest-facing hotel discovery and room browsing do not hide hotels/rooms in a way that breaks booking discovery. Align the rules with the required behavior: once a hotel uploads rooms, guests must be able to see that hotel’s rooms for booking in guest views.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "How will guests book if the hotel info is not there?",
          "after upload by hotel, it must be saved ... and visible to guests"
        ]
      },
      "acceptanceCriteria": [
        "A hotel that has uploaded rooms can be discovered and its rooms can be viewed by guests in the browse/detail flow, without requiring admin access.",
        "Any visibility gating (e.g., active/subscription status) is implemented consistently for both hotel list (getHotels) and room list (getRooms), and does not result in rooms being visible to admin but invisible to hotel owner/guests for the same hotel."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure frontend hotel dashboard and guest hotel detail views reliably refresh room data after create/update and do not accidentally query rooms with an invalid/anonymous hotelId. Keep all user-facing copy in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still not showing on hotel account and guest account",
          "bangun sekarang"
        ]
      },
      "acceptanceCriteria": [
        "Hotel Area > Rooms shows a loading state, then the correct rooms for the logged-in hotel principal; it does not depend on admin visibility to show rooms.",
        "After creating/updating a room in RoomsPanel, the rooms list updates without requiring a hard refresh (React Query cache invalidation/refetch works).",
        "Guest hotel detail page displays rooms for the hotel in the URL, and does not show an empty list if rooms exist in the backend."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a focused regression verification pass for the room upload/visibility flow covering hotel owner upload, guest browsing, and post-reload persistence, and document any steps needed to reproduce/verify the fix in the existing regression checklist.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "don't let there be any problems"
        ]
      },
      "acceptanceCriteria": [
        "There is a documented, repeatable set of steps (based on the existing checklist) to verify: hotel creates room with photos, hotel can still see it after reload, guest can see it in Browse/Hotel Detail, and admin view is consistent.",
        "Any errors encountered during room save or load are surfaced to the UI (English) rather than failing silently."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a stable-state schema change requires it.",
    "Do not edit frontend files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Adding new account types or changing the overall role model beyond what is necessary to fix room visibility.",
    "Introducing external databases or non-Motoko backend services.",
    "Implementing real-time updates (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer English for user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}