{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin principal purge UI + post-purge access enforcement and regression guardrails",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Block Hotel Area access until hotel activation is true, ensuring a purged hotel must re-activate and re-register before accessing the dashboard.",
      "acceptanceCriteria": [
        "After the purge, logging in as the purged hotel principal cannot access Hotel Area routes; the user is shown the existing Access Denied flow requiring activation.",
        "After admin generates a NEW invite token for the same principal and the hotel consumes it, the hotel can access Hotel Area again and can create a new hotel profile (re-registration).",
        "Existing guest flows (browse hotels, view hotel detail, create booking, view my bookings) continue to function for other hotels without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Enforce activation gating for the Hotel Area route by setting RequireRole's requireHotelActivation=true for /hotel, so unactivated (including purged) hotel principals see the existing AccessDeniedScreen + HotelActivationForm flow. Uses the authorization component's role/activation checks already wired through RequireRole. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an admin-only UI action to purge all data for a specified hotel Principal ID with explicit confirmation and immediate React Query cache refresh.",
      "acceptanceCriteria": [
        "Admin UI provides an input for a hotel Principal ID and a destructive purge button that requires a clear confirmation step (e.g., typing the principal or a confirmation phrase) before executing.",
        "On success, the UI invalidates/refetches relevant React Query caches (at minimum hotels list, invite tokens list, admin bookings views, and any hotel-profile queries) so removed data disappears without requiring a hard refresh.",
        "On failure, the UI shows a user-friendly error message and does not crash the app.",
        "Non-admin users cannot see or use the purge UI (consistent with existing admin route/role gating)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a dedicated React Query mutation hook for the new backend admin purge capability (added in REQ-1) that accepts a hotel Principal ID, performs the purge call, and on success invalidates relevant caches (e.g., hotels, inviteTokens, bookings, callerHotelProfile, isCallerHotelActivated). Keep user-facing error handling in the UI layer. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/PrincipalPurgePanel.tsx",
          "operation": "create",
          "description": "Create an Admin Panel section to run a destructive purge for a hotel Principal ID with explicit confirmation (e.g., require typing the exact principal ID or a fixed confirmation phrase). Use shadcn-ui building blocks already used elsewhere (Card, Alert, Input, Button) for consistent styling, and use the authorization-gated admin route as the visibility control. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Wire the new PrincipalPurgePanel into the Admin Panel page (admin-only area) in an appropriate location alongside existing admin tools, ensuring it is not an orphan component. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add frontend regression guardrails and checklist updates to reduce runtime errors and ensure key pages still render correctly after purge behavior.",
      "acceptanceCriteria": [
        "Guest Browse Hotels page renders successfully after purge and does not show placeholder/ghost rooms for any hotel.",
        "Admin Invite Tokens panel renders and works after purge (can still generate/copy tokens for other principals).",
        "Hotel activation flow still works end-to-end for a new hotel principal (admin creates token → hotel consumes → hotel can access Hotel Area).",
        "No infinite loading states are introduced in role/activation guards (RequireRole continues to show loading/error/denied states correctly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BrowseHotelsPage.tsx",
          "operation": "modify",
          "description": "Harden rendering against unexpected missing/empty nested data by adding defensive checks around rooms/pictures usage (e.g., avoid assuming hotel.rooms is always present) so the page cannot crash if a query returns partial data after a purge. Ensure any user-facing text remains in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/REGRESSION_CHECKLIST.md",
          "operation": "modify",
          "description": "Extend the existing regression checklist with explicit post-purge verification steps covering: Browse Hotels rendering, Admin Invite Tokens functionality, Admin Bookings view rendering, and Hotel activation gating (AccessDeniedScreen + HotelActivationForm) to ensure no cross-feature breakage. Ensure newly added checklist text is in English."
        }
      ]
    }
  ]
}