{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Hotel Area empty-state vs error and improve guest room photo fallbacks",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Differentiate empty room results from fetch failures or unexpected/filtered results in the Hotel Area Rooms UI, including a retry option.",
      "acceptanceCriteria": [
        "If the rooms query fails, show an explicit error state (not the empty-state message) with a retry option.",
        "If rooms exist but pictures are missing/empty, the UI should still show the room entry and a clear photos count (0) without hiding the room.",
        "The empty-state message (“No rooms yet...”) is only shown when the rooms query succeeds and returns an empty array for the hotel owner."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Update rooms listing states to avoid misleading empty-state messaging: (1) for roomsError, show a destructive error Alert plus a Retry button that triggers refetchRooms; (2) add a distinct 'unexpected/filtered results' warning state when the query succeeds but the returned rooms array does not contain any rooms owned by the current hotel (e.g., rooms.length > 0 but myRooms.length === 0), including a Retry action; (3) keep showing each room row regardless of pictures presence and continue displaying a photos count (0 when empty). Use shadcn-ui Alert/Button/Card primitives already used in this file to present the states. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Render guest-facing room photos reliably on Hotel Detail and provide a consistent fallback when rooms have zero valid or unloadable pictures.",
      "acceptanceCriteria": [
        "On Hotel Detail, each room displays its photos when `pictures` contains valid image strings.",
        "If `pictures` is empty or contains only invalid/unloadable strings, show a consistent fallback state (e.g., “No photos available for this room”) while keeping the rest of the room card and booking actions available.",
        "Photo rendering logic accepts the same `pictures` formats produced by the Hotel upload flow (currently data URLs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hotel/RoomPhotosSection.tsx",
          "operation": "modify",
          "description": "Harden photo rendering so unloadable images do not create blank UI: keep the existing validation for accepted formats (data URLs and http/https), but additionally track image load failures and automatically fall back to the next available image (or the 'No photos available for this room' fallback Card when none can be rendered). Ensure the fallback remains consistent for both main image and thumbnails, and do not remove/hide the entire room card or booking actions. Use shadcn-ui Card for the fallback UI already used by this component. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Confirm Hotel Detail consistently passes the backend-provided pictures array through to RoomPhotosSection (including data URLs) and does not gate room rendering on photo availability; keep booking actions enabled even when the photo section is in fallback mode. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}