{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend fixes for room data refresh, correct hotelId usage, and regression verification",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure hotel dashboard and guest hotel detail refresh room data correctly and never query rooms with an invalid/anonymous hotelId; keep UI copy in English.",
      "acceptanceCriteria": [
        "Hotel Area > Rooms shows a loading state, then the correct rooms for the logged-in hotel principal; it does not depend on admin visibility to show rooms.",
        "After creating/updating a room in RoomsPanel, the rooms list updates without requiring a hard refresh (React Query cache invalidation/refetch works).",
        "Guest hotel detail page displays rooms for the hotel in the URL, and does not show an empty list if rooms exist in the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Stop deriving hotelId from the raw identity principal (which may be undefined/anonymous early) and instead source the hotelId from the activated caller hotel profile (getCallerHotelProfile). Ensure the rooms query is disabled until a valid hotelId is available, show a clear English empty/blocked state when hotelId is not available, and keep the existing loading state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance the rooms query hook to support safe/conditional querying (e.g., accept an optional enabled flag and avoid issuing a backend call when hotelId is missing). Ensure query keys remain stable and that invalidation after create/update continues to refresh both hotel dashboard and guest detail views. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Harden hotelId parsing and room fetching for the guest hotel detail flow: handle invalid hotelId in the URL gracefully (English error UI), avoid double-filtering pitfalls, and surface room-load errors to the UI (toast/alert) rather than silently rendering an empty list when the query fails. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useRoomImageUpload.ts",
          "operation": "modify",
          "description": "Ensure room photo upload failures and progress states are consistently surfaced to the calling UI (English error messages) so room create/update does not appear to succeed when uploads fail. This continues to rely on the blob-storage ExternalBlob flow; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Document a focused regression verification pass for room upload/visibility and ensure room save/load errors are visible in the UI.",
      "acceptanceCriteria": [
        "There is a documented, repeatable set of steps (based on the existing checklist) to verify: hotel creates room with photos, hotel can still see it after reload, guest can see it in Browse/Hotel Detail, and admin view is consistent.",
        "Any errors encountered during room save or load are surfaced to the UI (English) rather than failing silently."
      ],
      "file_operations": [
        {
          "path": "frontend/REGRESSION_CHECKLIST.md",
          "operation": "modify",
          "description": "Add a dedicated, step-by-step verification section for the room upload persistence and visibility flow across hotel owner (Hotel Area > Rooms), guest browsing (Browse Hotels > Hotel Detail), and post-reload persistence. Include explicit checks for error surfacing (English) for both room save and room load failures. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Add explicit UI error surfacing for room load failures (not just save failures) so regressions are visible during verification; keep all user-facing strings in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Add explicit UI error surfacing for room load failures in the guest hotel detail page (e.g., toast/alert with retry guidance) to avoid silent empty states during regression verification; keep all user-facing strings in English. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}