{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Room schema updates: remove Room Number, add promo pricing, and enable room/photo edit & delete (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all frontend usage of roomNumber so rooms are identified/displayed without a Room Number field.",
      "acceptanceCriteria": [
        "The Add/Edit Room dialog no longer shows a \"Room Number\" input (screenshot-highlighted field removed).",
        "Frontend types (e.g., RoomView) no longer contain roomNumber.",
        "All backend methods and frontend hooks that previously accepted/returned roomNumber are updated accordingly and compile successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Remove roomNumber state/input and any rendering that labels rooms as \"Room {roomNumber}\"; update edit form initialization accordingly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomPhotosSection.tsx",
          "operation": "modify",
          "description": "Remove required roomNumber prop; update alt text/labels to use roomType or a generic label so callers don’t need roomNumber. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/booking/BookingForm.tsx",
          "operation": "modify",
          "description": "Remove any UI text that references room.roomNumber (e.g., subtitle) and rely on roomType/other existing fields. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Remove any roomNumber references in guest room cards and photo section props; use roomType and/or generic labels instead. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/types/extended-backend.ts",
          "operation": "modify",
          "description": "Update RoomView to remove roomNumber and align with current backend RoomView fields used in the app. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add promoPercent input (0–100) in room create/edit UI and display deterministic discounted nightly price across hotel management and guest booking flows.",
      "acceptanceCriteria": [
        "Room create/edit UI includes a required/visible Promo (%) numeric input (allow 0, max 100).",
        "When promo is entered, the UI shows the computed discounted price (basePrice minus promo%) before saving.",
        "Guest-facing room displays and booking price calculations use the discounted nightly price (not the base price) whenever promoPercent > 0.",
        "Promo validation prevents values outside 0–100 and prevents negative/zero base price."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/roomPricing.ts",
          "operation": "create",
          "description": "Add bigint-safe helpers to validate promoPercent (0–100) and compute discounted nightly price deterministically using integer math (base - (base*promo/100)). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Add Promo (%) numeric input to create/edit form; validate 0–100 and compute/show discounted price preview using bigint-safe helper; include promoPercent when building RoomInput for create/update. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Display promoPercent and show discounted price (and optionally base price) consistently in guest-facing room cards when promoPercent > 0; prefer backend-provided discountedPrice when available and fall back to deterministic local computation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/booking/BookingForm.tsx",
          "operation": "modify",
          "description": "Update price-per-night and total price calculations to use the discounted nightly price when promoPercent > 0 (prefer room.discountedPrice); ensure UI displays the same discounted price used in totals. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/types/extended-backend.ts",
          "operation": "modify",
          "description": "Extend RoomView to include promoPercent and discountedPrice fields (and keep pricePerNight as the base price) so management + guest flows can render both consistently. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add Delete action for each room in the hotel Rooms list and ensure UI refetches after updates/deletes.",
      "acceptanceCriteria": [
        "Each room card in the hotel Rooms list shows an Edit button (existing) and a Delete button.",
        "Delete prompts a confirmation before removing.",
        "After delete/update, relevant queries are invalidated/refetched so the UI updates without a hard refresh.",
        "Non-room features (profile, payments, bookings, admin panels) remain functional (no route/component breakage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a room delete mutation hook that calls the existing backend capability for deleting a room (use the actor typing strategy already used elsewhere in the app when a method is not present in generated types); invalidate rooms + callerHotelProfile + hotels/adminHotels queries on success. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Add a Delete button per room card with a confirmation prompt (use shadcn-ui AlertDialog if present, otherwise a safe fallback); call the new delete mutation; ensure list updates via query invalidation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide per-photo Delete and optional Replace controls in room management, persisting changes by updating the room pictures array and reflecting updates in guest-facing views.",
      "acceptanceCriteria": [
        "In the room photo gallery shown for a room, each thumbnail has a Delete control to remove that specific image from the room.",
        "Optional: each thumbnail provides a Replace/Edit control that lets the hotel upload a new image to replace that specific slot; replacement updates only that one picture URL in the room’s pictures array.",
        "Photo delete/replace persists by calling the room update API (or a dedicated backend method) and updates the UI immediately after success.",
        "Removing the last photo shows the existing \"No photos available\" empty state.",
        "Guest-facing room photos reflect the updated pictures array after hotel edits."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hotel/RoomPhotosSection.tsx",
          "operation": "modify",
          "description": "Add an optional \"editable\" mode for management views that renders per-image action controls (Delete + optional Replace) without changing the existing guest display behavior; keep the current empty state when pictures array becomes empty. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Wire RoomPhotosSection editable mode for each room card; implement per-photo delete/replace handlers that compute an updated pictures array and call updateRoom with the full current RoomInput (roomType/base price/currency/promoPercent + updated pictures). Use the existing useRoomImageUpload for replacement uploads (single-file upload). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HotelDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure guest photo rendering uses the room.pictures array as returned from queries (no cached/legacy roomNumber props); after hotel edits, refreshed room queries should reflect updated pictures. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update RoomsPanel and related hooks/types to match the new room schema: no roomNumber; include promoPercent and discounted-price display.",
      "acceptanceCriteria": [
        "frontend/src/components/hotel/RoomsPanel.tsx no longer uses roomNumber state/inputs and no longer renders \"Room {roomNumber}\" in the room card title.",
        "Create/update mutations invoked from the UI match the updated hook signatures (no roomNumber; include promoPercent).",
        "Room list UI shows roomType, base price, promo percent, and discounted price per night in a clear English format.",
        "No TypeScript errors related to RoomView or room mutations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useCreateRoom/useUpdateRoom to match current generated backend interface signatures: createRoom(input: RoomInput) and updateRoom(roomId, input); update params accordingly (roomType, pricePerNight, currency, promoPercent, pictures). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/hotel/RoomsPanel.tsx",
          "operation": "modify",
          "description": "Update create/update calls to use the updated hook signatures and RoomInput shape (no roomNumber; include promoPercent); display base price, promo percent, and discounted price per night on each room card in English using shared formatting utilities. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/types/extended-backend.ts",
          "operation": "modify",
          "description": "Align extended RoomView definition with the generated backend RoomView (promoPercent, discountedPrice, no roomNumber) and ensure all internal typing remains consistent across hotel management and guest pages. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}