{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin deploy/publish guidance and build version verification UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an admin-only \"Deployment / Publish Info\" section showing BUILD_VERSION and runtime info with one-click copy + success toast.",
      "acceptanceCriteria": [
        "Admin Panel includes a clearly labeled card/section (e.g., \"Deployment / Publish Info\")",
        "The section displays the same build version string used in the footer (BUILD_VERSION)",
        "The section displays the current window location (at least origin + pathname) and provides a copy-to-clipboard button",
        "Copy action shows a success toast and copies the displayed value exactly",
        "Section is visible only to admins (i.e., only on /admin behind existing RequireRole)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/DeploymentPublishInfoPanel.tsx",
          "operation": "create",
          "description": "Create an Admin Panel card titled \"Deployment / Publish Info\" that renders BUILD_VERSION (imported from buildInfo), window location info (origin + pathname at minimum), and best-effort detected network/canister host if available (e.g., derived from runtime/agent configuration when present). Include one-click copy-to-clipboard actions for each displayed value and show a success toast on copy using the existing toast system (sonner). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Wire the new DeploymentPublishInfoPanel into the existing Admin Panel page (no new routes), placing it as a clearly labeled section/card (e.g., near the existing deploy notice). Ensure it remains admin-only by relying on the existing /admin route protection (RequireAuth/RequireRole) unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve deploy/publish guidance text in the admin UI with Publish URL/Open App link retrieval steps, cache-busting instructions, and an in-app reload button.",
      "acceptanceCriteria": [
        "The deploy guidance explains that the platform may not display the Publish URL/Open App link reliably and provides concrete steps (refresh page, switch Draft/Live tabs)",
        "The deploy guidance includes cache-busting steps (hard refresh instructions)",
        "The UI includes a \"Reload app\" button that triggers a full page reload (location.reload)",
        "No non-English text is introduced in the new/updated UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/CaffeineDeployUiNotice.tsx",
          "operation": "modify",
          "description": "Extend the existing deploy/publish guidance UI so all user-facing text is English and explicitly explains how to obtain the platform Publish URL/Open App link (including steps like refreshing and switching Draft/Live tabs), includes cache-busting instructions (hard refresh), and adds a \"Reload app\" button that performs a full page reload via location.reload. Use existing shadcn UI components already present in the project without modifying files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Bump BUILD_VERSION so the current release is visibly identifiable in the footer and the new admin deployment info section.",
      "acceptanceCriteria": [
        "BUILD_VERSION is changed from its current value to a new value for this release",
        "The updated build version is visible in the AppShell footer",
        "The updated build version is also visible in the new Admin \"Deployment / Publish Info\" section"
      ],
      "file_operations": [
        {
          "path": "frontend/src/buildInfo.ts",
          "operation": "modify",
          "description": "Update the exported BUILD_VERSION constant from its current value (v44) to a new release value (e.g., v45) so users can visually confirm they are running the latest build in both the AppShell footer and admin deployment info UI. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}