{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fresh deploy retry via frontend build version bump + admin note about missing Publish URL",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Bump the frontend build version string to force a new build artifact and document the deploy retry outcome regarding the Publish URL / Open App link.",
      "acceptanceCriteria": [
        "`frontend/src/buildInfo.ts` BUILD_VERSION is incremented from its current value to a new value (e.g., v33) to trigger a new build artifact.",
        "A new build+deploy is executed after the version bump.",
        "The resulting Caffeine deploy output includes a visible Publish URL / “Open App” link; if it is still missing, record the deploy attempt outcome for follow-up (error message or confirmation that deploy succeeded but URL did not appear)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/buildInfo.ts",
          "operation": "modify",
          "description": "Increment BUILD_VERSION (currently 'v32') to a new value to force a fresh frontend build artifact for the next deploy attempt."
        },
        {
          "path": "frontend/RELEASE_NOTES.md",
          "operation": "modify",
          "description": "Add a short section/template to record the deploy retry outcome, including whether Caffeine showed a Publish URL / “Open App” link and any relevant deploy output if it remains missing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a concise admin-facing notice in the Admin Panel about the Caffeine UI sometimes not showing the Publish URL / Open App link after successful deploys.",
      "acceptanceCriteria": [
        "Admin Panel contains a concise English notice about the potential Caffeine deploy UI issue (missing Publish URL / Open App) and the plan to retry later if it happens.",
        "The notice does not change any business logic and does not block normal app usage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/CaffeineDeployUiNotice.tsx",
          "operation": "create",
          "description": "Create a small, admin-facing informational notice component. Use shadcn-ui (compose via existing UI primitives like Card/typography) to display a non-blocking message; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Render the new CaffeineDeployUiNotice near the top of the Admin Panel (above existing panels), ensuring it is informational only and does not affect any admin tools or app flows."
        }
      ]
    }
  ]
}