{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Version 24 role-based access UI (Admin/Hotel/Guest) and expose V24 build identifier",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore Version 24 role-based route guarding and navigation visibility so Admin and Hotel accounts are not treated as Guests, and /admin and /hotel behave correctly.",
      "acceptanceCriteria": [
        "When logged in with an Admin principal that previously had admin access in Version 24, navigating to /admin shows the Admin Panel UI (not AccessDenied) and the TopNav includes the expected admin navigation.",
        "When logged in with a Hotel owner principal that previously had hotel access in Version 24, navigating to /hotel shows the Hotel Management dashboard and tabs (Profile, Rooms, Payments, Bookings, Record Stays, Subscription).",
        "When logged in with a Guest principal, /admin and /hotel remain protected and show an appropriate access denied screen (no privilege escalation).",
        "No account type (admin/hotel/guest) is unintentionally downgraded to Guest due to frontend caching or backend role checks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden role/admin/hotel-activation React Query hooks against stale/cross-session caching by scoping auth-related query keys to the current authenticated principal and disabling role/admin queries when unauthenticated; ensure refetch behavior reliably re-checks role after login/logout transitions (Version 24 behavior)."
        },
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Fix guard logic so Admin bypass does not wait on hotel activation checks, and only performs hotel activation checks when the resolved role is Hotel (UserRole.user) (avoid mistakenly denying Admin/Hotel due to unnecessary hotel-profile loading or rejected queries)."
        },
        {
          "path": "frontend/src/components/nav/TopNav.tsx",
          "operation": "modify",
          "description": "Adjust role-based navigation visibility to match Version 24 expectations: ensure Admin Panel visibility is driven by definitive admin check, and Hotel Area visibility does not regress due to loading/order-of-queries issues; keep Guest users from seeing protected navigation."
        },
        {
          "path": "frontend/src/pages/HotelAreaPage.tsx",
          "operation": "modify",
          "description": "Ensure the Hotel Management dashboard reliably renders for activated hotel owners and does not incorrectly show 'Hotel Profile Not Found' due to transient role/activation query timing; keep user-facing messaging in English."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Verify AccessDenied messaging and role labels remain consistent with Version 24 (Admin/Hotel/Guest naming) and remain in English; ensure denial states are appropriate for Guests accessing /admin or /hotel."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the visible/inspectable build identifier to reflect Version 24 rollback and ensure all auth/role/access UI text remains English.",
      "acceptanceCriteria": [
        "The app exposes a visible or inspectable build identifier indicating Version 24 is running (e.g., via the existing build version constant).",
        "All user-facing messages related to auth/role/access continue to be English (no regressions to non-English UI strings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/buildInfo.ts",
          "operation": "modify",
          "description": "Update the BUILD_VERSION constant to clearly indicate Version 24 (rollback) so production verification can confirm the correct build."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Surface the BUILD_VERSION in an existing UI location (e.g., footer) to make the Version 24 identifier visible/inspectable without adding new routes or pages; ensure displayed text is English."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update and run the frontend regression checks for auth/role gating, Admin Panel access, and Hotel Area access after restoring Version 24 behavior.",
      "acceptanceCriteria": [
        "All checklist items under 'Authentication & Authorization' in frontend/REGRESSION_CHECKLIST.md pass.",
        "Admin Panel checklist items (Invite token generation, hotel visibility controls, admin booking visibility) are accessible to Admin users only.",
        "Hotel Management access works for activated hotel owners and remains inaccessible to guests."
      ],
      "file_operations": [
        {
          "path": "frontend/REGRESSION_CHECKLIST.md",
          "operation": "modify",
          "description": "Augment the existing checklist with explicit post-rollback (V24) verification steps for role detection, TopNav link visibility, /admin and /hotel guard behavior for Admin/Hotel/Guest, and cache-clearing expectations after logout/login; keep checklist text in English."
        },
        {
          "path": "frontend/src/components/debug/AuthDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Refine the debug diagnostics wording (English) to align with the restored Version 24 role model (Admin/Hotel/Guest) and make it easier to validate that role/admin/hotel-activation signals match expected access for /admin and /hotel."
        }
      ]
    }
  ]
}