{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore TopNav + add My Bookings route to match screenshots",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Restore TopNav links/labels (Home, Browse Hotels, My Bookings, Account, Hotel Area; Admin Panel admin-only) and ensure My Bookings navigates to a working bookings view.",
      "acceptanceCriteria": [
        "Top navigation includes a 'My Bookings' entry as shown in the screenshot and it leads to a working bookings view.",
        "Top navigation includes a Home entry that routes to '/'.",
        "The account link label matches the screenshot expectation (e.g., 'Account' instead of 'My Account') while still routing correctly.",
        "Admin users see 'Admin Panel' in TopNav; non-admin users do not.",
        "The 'Hotel Area' link appears for admin and activated hotel users as intended, consistent with guards."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/nav/TopNav.tsx",
          "operation": "modify",
          "description": "Update navigation structure to include explicit 'Home' and 'My Bookings' links, rename the account link label to 'Account' (keep routing to /account), and keep role-gated visibility for 'Admin Panel' and 'Hotel Area'. Use existing shadcn-ui Button styling and current auth/role query hooks; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure any new nav destinations introduced in TopNav (notably /bookings) are registered in the router so links are not broken."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a dedicated /bookings route that renders the same bookings list UI currently shown on GuestAccountPage, protected by the same auth + profile completion gates as /account.",
      "acceptanceCriteria": [
        "Visiting the 'My Bookings' route while logged out redirects to login/RequireAuth behavior (consistent with existing protected routes).",
        "Visiting the 'My Bookings' route while logged in shows the bookings list and booking detail dialog without errors.",
        "No existing routes (/account, /guest) break; they continue to function."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyBookingsPage.tsx",
          "operation": "create",
          "description": "Create a dedicated My Bookings page that renders the bookings table and booking details dialog using the same logic/queries as GuestAccountPage, with English user-facing text. Compose with existing UI components (shadcn-ui Card/Table/Button) and booking components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/booking/MyBookingsTable.tsx",
          "operation": "create",
          "description": "Extract the bookings table + empty/loading states (including BookingDetailsDialog and BookingStatusBadge usage) into a shared component so it can be reused by both GuestAccountPage and MyBookingsPage without duplicating logic. Use existing shadcn-ui Table/Card primitives; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GuestAccountPage.tsx",
          "operation": "modify",
          "description": "Refactor GuestAccountPage to reuse the new shared MyBookingsTable component for the bookings list section, keeping the rest of the account/CTA layout intact and all text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new '/bookings' route that renders MyBookingsPage and wrap it with the same <RequireAuth> + <ProfileCompletionGate> wrappers used by '/account' so protection behavior matches."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Satisfy the relevant frontend regression checklist items for navigation and bookings, and fix any UI regressions impacting the affected flows.",
      "acceptanceCriteria": [
        "Admin flow: Invite Tokens section can generate tokens and displays them in the table.",
        "Guest flow: Guest Account / bookings view shows booking rows (or an empty state) and does not crash.",
        "Hotel flow: Hotel Area is reachable for activated hotel users and shows its tabbed UI.",
        "Navigation links lead to the correct pages and are shown/hidden based on role as expected."
      ],
      "file_operations": [
        {
          "path": "frontend/REGRESSION_CHECKLIST.md",
          "operation": "modify",
          "description": "Update the checklist to explicitly include verification of the new 'My Bookings' TopNav entry and the dedicated '/bookings' route behavior (logged out vs logged in), aligning with the restored navigation expectations."
        },
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "If regression testing reveals role-guard loading or gating inconsistencies affecting TopNav link visibility or protected routes, adjust guard logic and loading/error handling to prevent infinite 'Checking permissions...' states and keep behavior consistent with role-based navigation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "If regression testing reveals stale role/admin/hotel-activation states causing incorrect navigation/guard behavior after login/logout, adjust query keys/enabled flags/invalidation to ensure role-gated UI updates promptly and reliably without regressions."
        }
      ]
    }
  ]
}