{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Add missing room-photos frontend views for hotel and guest accounts so uploaded room photos display (like admin), with hotel manage actions and guest view in Browse Hotels/Hotel Detail.",
  "architectural_notes": [
    "Room photos are stored (backend) but missing/not implemented in frontend for Hotel and Guest accounts; need parity with Admin UI for display and management permissions."
  ],
  "known_issues": [
    "Room photos are not showing (empty) in Hotel account and Guest account (Browse Hotels), despite uploads/deploys."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-on-the-guest-account-browse-hotels-page-display-room-photo-thumbnails-inside-each-hotel-card-similar-to-admin-s-photo-presentation-and-allow-click-to-zoom-preview",
      "title": "On the Guest account Browse Hotels page, display room photo thumbnails inside each hotel card (similar to Admin’s photo presentation), and allow click-to-zoom preview.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-apply-a-consistent-visual-theme-across-the-affected-pages-hotel-area-rooms-browse-hotels-hotel-detail-with-a-warm-hospitality-oriented-style-neutral-backgrounds-orange-accents-keeping-typography-and-spacing-consistent-and-avoiding-blue-purple-as-primary-brand-colors",
      "title": "Apply a consistent visual theme across the affected pages (Hotel Area Rooms, Browse Hotels, Hotel Detail) with a warm, hospitality-oriented style (neutral backgrounds + orange accents), keeping typography and spacing consistent and avoiding blue/purple as primary brand colors.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Display uploaded room photos in Hotel account and Guest account (Browse Hotels and Hotel Detail) same as Admin; Hotel can upload/edit/delete, Guest views and can zoom.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix backend room/room-photo visibility so Hotel owners and Guests can fetch rooms (including the `pictures` array) and see the same room photo data that is currently visible in the Admin UI.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "In the Hotel account (Hotel Area → Rooms), render all previously uploaded room photos for each existing room, and ensure the hotel owner can add and remove photos when creating/editing a room.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Enforce role-based room photo UI permissions consistently: Hotel owners can add/remove photos via room create/edit; Guests are view-only and cannot see any edit/delete controls for room photos.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Show uploaded room photos in Hotel account and Guest Browse Hotels (with zoom)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}