{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project to ensure hotel room photos uploaded by hotel accounts are stored in backend and displayed consistently for hotel, admin, and guest accounts; currently photos appear only in admin.",
  "architectural_notes": [
    "Room photos are mastered by the hotel account: upload -> persist in backend storage -> shared read access for admin and guest views; all roles must render the same photo data source."
  ],
  "known_issues": [
    "Bug: room photos appear in admin account but not in hotel or guest accounts; expected to be consistent across all roles from hotel uploads."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-hotel-area-rooms-ui-to-clearly-differentiate-between-a-genuinely-empty-room-results-and-b-backend-fetch-failures-or-filtered-unauthorized-results-so-hotel-owners-are-not-shown-a-misleading-no-rooms-yet-state-when-the-backend-call-failed-or-returned-unexpected-filtered-results-that-hide-existing-rooms-photos",
      "title": "Update the Hotel Area Rooms UI to clearly differentiate between (a) genuinely empty room results and (b) backend fetch failures or filtered/unauthorized results, so Hotel owners are not shown a misleading “No rooms yet” state when the backend call failed or returned unexpected filtered results that hide existing rooms/photos.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-guest-facing-hotel-detail-page-renders-room-photos-reliably-using-the-returned-pictures-strings-and-provide-a-safe-fallback-ui-when-rooms-exist-but-a-room-has-zero-valid-pictures-so-guests-can-still-browse-and-book",
      "title": "Ensure the guest-facing Hotel Detail page renders room photos reliably using the returned `pictures` strings, and provide a safe fallback UI when rooms exist but a room has zero valid pictures so guests can still browse and book.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Ensure room photos uploaded by hotel are persisted in backend and displayed identically across hotel, admin, and guest accounts",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix backend room retrieval so the same room records (including the full `pictures : [Text]` array) are returned consistently for Admin, the owning Hotel account, and Guests. Rooms that appear for Admin must not disappear or lose their `pictures` data when viewed by the owning Hotel account or by Guests browsing a hotel.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix backend room create/update persistence so when the Hotel account saves a room with `pictures`, the stored room record retains the provided `pictures` list and remains associated with the correct `hotelId` for all subsequent reads (Admin/Hotel/Guest).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix room photo persistence and visibility for Hotel and Guest accounts",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}