{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Hotel management system: need ability to fully purge all data associated with a given principal ID (including admin-created tokens and legacy photos/descriptions) and enforce hotel dashboard access control requiring admin activation; hotels must re-register after purge.",
  "architectural_notes": [
    "Implement principal-ID scoped purge as a controlled, audited destructive operation (delete or anonymize all related records, including auth tokens and media metadata).",
    "Enforce authorization: hotel dashboard access must be denied unless the hotel account is in an admin-activated state."
  ],
  "known_issues": [
    "Risk: destructive principal-ID purge could accidentally impact unrelated data/features if relationships are not correctly scoped; needs careful safeguards/testing."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-hotel-dashboard-access-is-blocked-after-a-purge-until-the-hotel-re-registers-and-is-activated-again-by-admin-invite-token-consumption",
      "title": "Ensure hotel dashboard access is blocked after a purge until the hotel re-registers and is activated again by admin invite token consumption.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-admin-panel-ui-action-to-run-the-full-principal-purge-safely-with-explicit-confirmation-and-refresh-affected-cached-queries-so-the-ui-immediately-reflects-the-deletion",
      "title": "Add an Admin Panel UI action to run the full principal purge safely (with explicit confirmation) and refresh affected cached queries so the UI immediately reflects the deletion.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-regression-checks-and-guardrails-to-prevent-runtime-errors-or-cross-feature-breakage-after-introducing-purge-behavior",
      "title": "Add regression checks and guardrails to prevent runtime errors or cross-feature breakage after introducing purge behavior.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Hard-delete (purge) all data associated with a specified principal ID, including admin-created tokens and any stored photos/descriptions",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "After purge, require hotel to re-register; block hotel dashboard access until admin activates the new registration",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a backend admin-only API to fully purge (hard-delete) all data associated with the hotel Principal ID `opo7v-ka45k-pk32j-76qsi-o3ngz-e6tgc-755di-t2vx3-t2ugj-qnpbc-gae` without affecting any other principals’ data.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Admin purge of all data for a specific hotel Principal ID and enforce re-registration + activation",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}