{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 7,
  "summary": "Fix backend regressions preventing hotel profile saving and cross-portal visibility (hotel/admin/guest), and implement a standard hotel booking flow (select room, quantity, guests, dates) with booking visibility and status sync across guest/hotel/admin portals, plus enable hotel-managed flexible payment methods and hotel email entry.",
  "architectural_notes": [
    "Backend must expose a working createRoom function (previously existed) for saving room data including photo upload; client currently calls extendedActor.createRoom.",
    "Frontend is calling a hotel profile update API (error reported: `extendedActor.updateHotelProfile is not a function`); backend Candid/actor must expose the expected hotel profile save/update methods.",
    "Hotel visibility across portals depends on backend listing/filtering (e.g., active/published/approved/subscription/token-used status) and persisted hotel records; ensure admin/guest listings source from correct storage and criteria.",
    "Booking system requires persisted Booking records with status transitions (e.g., Pending -> Confirmed) and cross-portal query APIs so guest/hotel/admin all read the same source of truth.",
    "Payment methods must be stored as hotel-defined/free-form entries (not hardcoded providers) and surfaced to guests as options including pay-online vs pay-at-hotel."
  ],
  "known_issues": [
    "Regression: hotel cannot save room data (including room photo upload). Error shown: “extendedActor.createRoom is not a function” and all room fields fail to save.",
    "Regression: Hotel profile Save does not work; runtime error reported: `extendedActor.updateHotelProfile is not a function`.",
    "Hotels do not appear in admin and guest portals (shows 'No Hotels Available') even after hotel profile is filled and marked active / token used.",
    "Guest booking is currently unavailable (UI indicates 'Booking functionality is currently unavailable/coming soon'), so bookings cannot be created.",
    "Hotel portal cannot currently add/manage payment methods and cannot save hotel email (features not active)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-replace-the-placeholder-guest-booking-ui-with-a-working-standard-hotel-booking-flow-on-the-hotel-detail-page-guest-selects-a-room-then-can-choose-check-in-date-check-out-date-number-of-rooms-and-number-of-guests-and-submit-a-booking",
      "title": "Replace the placeholder guest booking UI with a working standard hotel booking flow on the Hotel Detail page: guest selects a room, then can choose check-in date, check-out date, number of rooms, and number of guests, and submit a booking.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-guest-booking-visibility-in-the-guest-portal-by-replacing-the-placeholder-my-bookings-ui-with-a-real-bookings-table-that-loads-from-getbookings-shows-status-dates-room-quantity-guests-total-price-and-opens-booking-details-using-the-existing-booking-details-dialog-where-appropriate",
      "title": "Implement guest booking visibility in the Guest portal by replacing the placeholder 'My Bookings' UI with a real bookings table that loads from `getBookings`, shows status, dates, room quantity, guests, total price, and opens booking details using the existing booking details dialog where appropriate.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-hotel-side-booking-management-by-replacing-the-placeholder-hotel-bookings-panel-with-a-list-table-of-bookings-for-the-caller-hotel-including-an-action-to-confirm-a-pending-booking-calling-updatebookingstatus",
      "title": "Implement hotel-side booking management by replacing the placeholder Hotel Bookings panel with a list/table of bookings for the caller hotel, including an action to confirm a pending booking (calling `updateBookingStatus`).",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-admin-side-bookings-overview-by-replacing-the-placeholder-admin-bookings-panel-with-a-real-bookings-list-that-can-display-bookings-across-all-hotels-using-getbookings-including-status-and-key-booking-fields",
      "title": "Implement admin-side bookings overview by replacing the placeholder Admin Bookings panel with a real bookings list that can display bookings across all hotels (using `getBookings`), including status and key booking fields.",
      "reqIds": [
        "REQ-17"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-placeholder-hotel-payment-methods-panel-ui-with-an-operational-management-ui-add-payment-method-name-details-list-existing-methods-and-remove-method-actions-do-not-hardcode-payment-providers-or-countries",
      "title": "Replace the placeholder Hotel Payment Methods panel UI with an operational management UI: add payment method (name, details), list existing methods, and remove method actions; do not hardcode payment providers or countries.",
      "reqIds": [
        "REQ-19"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-hotel-email-entry-is-functional-end-to-end-the-hotel-profile-save-flow-must-persist-the-email-field-to-the-backend-and-reflect-it-in-hotel-profile-reads-and-guest-facing-contact-sections-where-applicable",
      "title": "Ensure hotel email entry is functional end-to-end: the Hotel Profile Save flow must persist the email field to the backend and reflect it in hotel profile reads and guest-facing contact sections where applicable.",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "feature-add-focused-regression-verification-aligned-with-frontend-regression-checklist-md-to-confirm-that-enabling-bookings-and-payment-methods-does-not-break-existing-flows-auth-browse-hotels-hotel-profile-rooms-admin-hotel-visibility",
      "title": "Add focused regression verification aligned with `frontend/REGRESSION_CHECKLIST.md` to confirm that enabling bookings and payment methods does not break existing flows (auth, browse hotels, hotel profile, rooms, admin hotel visibility).",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Restore the backend canister API methods required by the current frontend to save hotel room data, specifically implementing `createRoom`, `updateRoom`, and `getRooms` in `backend/main.mo` with signatures compatible with the frontend’s `ExtendedBackendInterface` so the runtime error `extendedActor.createRoom is not a function` no longer occurs.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Ensure an activated hotel caller can successfully save rooms even if their hotel profile record does not yet exist in `hotelsMap` by creating/initializing a default hotel profile on-demand (e.g., during `createRoom`) and maintaining the `rooms` list in the hotel profile so `getCallerHotelProfile()` returns the newly created rooms in `HotelDataView.rooms`.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Align the backend’s exposed Candid interface with the frontend expectations so the generated actor used by the app includes the restored room APIs (no missing-method runtime errors).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Restore/implement backend canister API methods required by the frontend to save/update hotel profile data (e.g., `updateHotelProfile` / equivalent) with signatures compatible with the frontend actor, fixing the runtime error `extendedActor.updateHotelProfile is not a function` and making the Hotel Profile Save button functional.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Fix backend logic and queries so hotels that have completed/activated profiles (and used tokens / are marked active) are returned to admin and guest portals (no more 'No Hotels Available'), including ensuring hotel records exist in storage and are included in the public/admin listing APIs.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Align the backend canister Candid API with the frontend’s `ExtendedBackendInterface` so the runtime errors like `extendedActor.updateHotelProfile is not a function` and other missing-method errors cannot occur.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement `updateHotelProfile(name, location, address, mapLink, whatsapp, email)` in `backend/main.mo` with the exact parameter order expected by the frontend, and persist the updated fields into the caller’s hotel record.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Fix/restore room APIs to match frontend signatures: implement `getRooms(filters: RoomQuery)`, `createRoom(roomNumber, roomType, pricePerNight, currency, pictures)`, and `updateRoom(roomId, roomNumber, roomType, pricePerNight, currency, pictures)` in `backend/main.mo`, ensuring they work for activated hotels.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Ensure an activated hotel can create rooms and appear in admin/guest hotel lists even if their hotel profile record did not previously exist, by initializing and maintaining a consistent hotel record in storage (including a maintained list of room IDs).",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Implement/restore `getHotels()` in `backend/main.mo` to return the hotel list used by both admin visibility tools and guest browsing, and ensure hotels marked active are returned so the guest Browse Hotels page does not show “No Hotels Available” incorrectly.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Implement admin hotel management APIs required by the existing admin UI: `setHotelActiveStatus(hotelId, active)` and `setHotelSubscriptionStatus(hotelId, status)` in `backend/main.mo`, enforcing admin-only access.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Restore/implement any additional backend methods referenced by the frontend hooks so authentication/role checks and invite token flow do not error at runtime (at minimum: `getCallerUserRole`, `isCallerAdmin`, `makeMeAdmin`, `validateInviteToken`).",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "Add a focused regression check (manual or automated where applicable) using the existing `frontend/REGRESSION_CHECKLIST.md` flow to verify: hotel profile saving, room create/update with photos, guest browse hotel visibility, and admin hotel visibility toggles.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Implement and enable standard booking flow for guests: select hotel/room, choose booking dates, number of rooms, and number of guests, then create a booking record (currently UI shows booking is unavailable/coming soon).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "Add booking management across portals: bookings created by guests must appear in the Hotel account and Admin portal; Hotel can confirm a booking; booking status must update to Confirmed consistently in Guest, Hotel, and Admin views.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "Implement flexible hotel-managed payment methods: do not hardcode country/payment providers; allow each hotel to add/edit its own payment methods (e.g., GoPay/DANA/ShopeePay/bank transfer/etc.) and expose them for guest checkout choice (online vs pay-at-hotel). Admin does not manage payment methods.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "Fix/enable Hotel Portal fields that are currently not active: allow hotel to enter/save hotel email and add/manage payment methods from the hotel account without breaking existing features.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "Implement backend booking APIs required by the frontend `ExtendedBackendInterface`: `createBooking(hotelId, roomId, checkIn, checkOut, guests, currency)`, `getBookings(filters)`, and `updateBookingStatus(bookingId, newStatus)` with correct authorization so bookings work for guest, hotel, and admin portals.",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "Extend the booking data model to support 'number of rooms' (room quantity) and ensure `totalPrice` is computed based on nights × pricePerNight × roomQuantity (and persisted on the booking record).",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-24",
      "summary": "Enable flexible hotel-managed payment methods: implement backend APIs `addPaymentMethod(name, details)` and `removePaymentMethod(index)` for activated hotels, persist them to the hotel profile, and expose them through existing hotel profile queries (e.g., `getHotels`, `getCallerHotelProfile`, `getHotelProfile`).",
      "reqIds": [
        "REQ-18"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix backend regression: restore room create/update APIs so hotel room data (including photo URLs) can be saved",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}