{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 15,
  "summary": "Fix backend regressions and complete booking/payment/cancellation flows, and additionally clean up legacy/stale backend data causing ghost room photos in guest/admin browsing and undeletable legacy payment method entries (e.g., GoPay/email) in hotel payment methods—without impacting other working features.",
  "architectural_notes": [
    "Backend must expose a working createRoom function (previously existed) for saving room data including photo upload; client currently calls extendedActor.createRoom.",
    "Frontend is calling a hotel profile update API (error reported: `extendedActor.updateHotelProfile is not a function`); backend Candid/actor must expose the expected hotel profile save/update methods.",
    "Hotel visibility across portals depends on backend listing/filtering (e.g., active/published/approved/subscription/token-used status) and persisted hotel records; ensure admin/guest listings source from correct storage and criteria.",
    "Booking system requires persisted Booking records with status transitions (e.g., Pending -> Confirmed) and cross-portal query APIs so guest/hotel/admin all read the same source of truth.",
    "Payment methods must be stored as hotel-defined/free-form entries (not hardcoded providers) and surfaced to guests as options including pay-online vs pay-at-hotel.",
    "Booking flow decision: guest creates booking with initial status `Pending`; hotel confirms booking (status -> `Confirmed`); the system does not enforce or automate payment (online/offline payment happens outside the system by mutual agreement), and no payment-proof upload step is required.",
    "Current booking failure shows backend response/message: \"Booking functionality not yet available in backend\" — indicates booking endpoints are not implemented/enabled on the backend, so Confirm/Create Booking cannot work until booking APIs are live.",
    "Booking cancellation rules: Guest may cancel only when status is `Pending`; once `Confirmed`, only the Hotel may cancel. Cancelled/Confirmed bookings must remain visible in booking history for reporting. Backend status transitions and authorization in `updateBookingStatus` must enforce these rules.",
    "Stale/legacy backend data may be leaking into Guest/Admin hotel browsing (ghost room photos) despite not appearing in the Hotel portal; implement a safe cleanup/migration path to remove orphaned room photo data and ensure all portals read from the same canonical room/photo source.",
    "Legacy payment method data (e.g., GoPay/email) may be persisted in an older schema/location that current delete flows don’t affect; backend should support removing these legacy entries and prevent email being stored inside payment methods, using Hotel Profile email as the single source of truth."
  ],
  "known_issues": [
    "Regression: hotel cannot save room data (including room photo upload). Error shown: “extendedActor.createRoom is not a function” and all room fields fail to save.",
    "Regression: Hotel profile Save does not work; runtime error reported: `extendedActor.updateHotelProfile is not a function`.",
    "Hotels do not appear in admin and guest portals (shows 'No Hotels Available') even after hotel profile is filled and marked active / token used.",
    "Guest booking is currently unavailable (UI indicates 'Booking functionality is currently unavailable/coming soon'), so bookings cannot be created.",
    "Hotel portal cannot currently add/manage payment methods and cannot save hotel email (features not active).",
    "Build/deploy pipeline is failing repeatedly due to platform/tooling error (Caffeine unable to complete build), blocking verification and release of booking fixes.",
    "Booking still fails at runtime with message \"Booking functionality not yet available in backend\", indicating backend booking APIs are not active/implemented.",
    "Stale legacy room photos still appear in Guest/Admin hotel browsing even though the Hotel portal no longer shows them (ghost/orphaned data).",
    "Hotel payment methods contain a legacy 'GOPAY' (and old email) entry that cannot be deleted via the current UI; requires backend cleanup/removal without breaking other features."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-replace-the-placeholder-guest-booking-ui-with-a-working-standard-hotel-booking-flow-on-the-hotel-detail-page-guest-selects-a-room-then-can-choose-check-in-date-check-out-date-number-of-rooms-and-number-of-guests-and-submit-a-booking",
      "title": "Replace the placeholder guest booking UI with a working standard hotel booking flow on the Hotel Detail page: guest selects a room, then can choose check-in date, check-out date, number of rooms, and number of guests, and submit a booking.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-guest-booking-visibility-in-the-guest-portal-by-replacing-the-placeholder-my-bookings-ui-with-a-real-bookings-table-that-loads-from-getbookings-shows-status-dates-room-quantity-guests-total-price-and-opens-booking-details-using-the-existing-booking-details-dialog-where-appropriate",
      "title": "Implement guest booking visibility in the Guest portal by replacing the placeholder 'My Bookings' UI with a real bookings table that loads from `getBookings`, shows status, dates, room quantity, guests, total price, and opens booking details using the existing booking details dialog where appropriate.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-hotel-side-booking-management-by-replacing-the-placeholder-hotel-bookings-panel-with-a-list-table-of-bookings-for-the-caller-hotel-including-an-action-to-confirm-a-pending-booking-calling-updatebookingstatus",
      "title": "Implement hotel-side booking management by replacing the placeholder Hotel Bookings panel with a list/table of bookings for the caller hotel, including an action to confirm a pending booking (calling `updateBookingStatus`).",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-admin-side-bookings-overview-by-replacing-the-placeholder-admin-bookings-panel-with-a-real-bookings-list-that-can-display-bookings-across-all-hotels-using-getbookings-including-status-and-key-booking-fields",
      "title": "Implement admin-side bookings overview by replacing the placeholder Admin Bookings panel with a real bookings list that can display bookings across all hotels (using `getBookings`), including status and key booking fields.",
      "reqIds": [
        "REQ-17"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-placeholder-hotel-payment-methods-panel-ui-with-an-operational-management-ui-add-payment-method-name-details-list-existing-methods-and-remove-method-actions-do-not-hardcode-payment-providers-or-countries",
      "title": "Replace the placeholder Hotel Payment Methods panel UI with an operational management UI: add payment method (name, details), list existing methods, and remove method actions; do not hardcode payment providers or countries.",
      "reqIds": [
        "REQ-19"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-hotel-email-entry-is-functional-end-to-end-the-hotel-profile-save-flow-must-persist-the-email-field-to-the-backend-and-reflect-it-in-hotel-profile-reads-and-guest-facing-contact-sections-where-applicable",
      "title": "Ensure hotel email entry is functional end-to-end: the Hotel Profile Save flow must persist the email field to the backend and reflect it in hotel profile reads and guest-facing contact sections where applicable.",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "feature-add-focused-regression-verification-aligned-with-frontend-regression-checklist-md-to-confirm-that-enabling-bookings-and-payment-methods-does-not-break-existing-flows-auth-browse-hotels-hotel-profile-rooms-admin-hotel-visibility",
      "title": "Add focused regression verification aligned with `frontend/REGRESSION_CHECKLIST.md` to confirm that enabling bookings and payment methods does not break existing flows (auth, browse hotels, hotel profile, rooms, admin hotel visibility).",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    },
    {
      "id": "feature-identify-and-fix-the-root-cause-s-of-the-repeated-caffeine-build-failures-so-the-project-can-compile-and-deploy-successfully-without-changing-product-behavior",
      "title": "Identify and fix the root cause(s) of the repeated Caffeine build failures so the project can compile and deploy successfully without changing product behavior.",
      "reqIds": [
        "REQ-22"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-guest-side-cancel-action-in-the-guest-portal-booking-history-table-so-that-guests-can-cancel-a-booking-when-and-only-when-its-status-is-pendingtransfer-the-cancel-action-must-call-the-existing-useupdatebookingstatus-mutation-with-bookingstatus-canceled-refresh-the-bookings-list-and-show-success-error-feedback-in-english",
      "title": "Add a guest-side Cancel action in the Guest portal booking history table so that guests can cancel a booking when (and only when) its status is `pendingTransfer`. The cancel action must call the existing `useUpdateBookingStatus` mutation with `BookingStatus.canceled`, refresh the bookings list, and show success/error feedback in English.",
      "reqIds": [
        "REQ-29"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-hotel-side-cancel-action-in-the-hotel-bookings-ui-so-that-hotel-users-can-cancel-bookings-for-their-hotel-when-the-booking-is-pendingtransfer-or-booked-the-cancel-action-must-call-the-existing-useupdatebookingstatus-mutation-with-bookingstatus-canceled-refresh-the-bookings-list-and-show-success-error-feedback-in-english",
      "title": "Add a hotel-side Cancel action in the Hotel bookings UI so that hotel users can cancel bookings for their hotel when the booking is `pendingTransfer` or `booked`. The cancel action must call the existing `useUpdateBookingStatus` mutation with `BookingStatus.canceled`, refresh the bookings list, and show success/error feedback in English.",
      "reqIds": [
        "REQ-30"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Restore the backend canister API methods required by the current frontend to save hotel room data, specifically implementing `createRoom`, `updateRoom`, and `getRooms` in `backend/main.mo` with signatures compatible with the frontend’s `ExtendedBackendInterface` so the runtime error `extendedActor.createRoom is not a function` no longer occurs.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Ensure an activated hotel caller can successfully save rooms even if their hotel profile record does not yet exist in `hotelsMap` by creating/initializing a default hotel profile on-demand (e.g., during `createRoom`) and maintaining the `rooms` list in the hotel profile so `getCallerHotelProfile()` returns the newly created rooms in `HotelDataView.rooms`.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Align the backend’s exposed Candid interface with the frontend expectations so the generated actor used by the app includes the restored room APIs (no missing-method runtime errors).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Restore/implement backend canister API methods required by the frontend to save/update hotel profile data (e.g., `updateHotelProfile` / equivalent) with signatures compatible with the frontend actor, fixing the runtime error `extendedActor.updateHotelProfile is not a function` and making the Hotel Profile Save button functional.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Fix backend logic and queries so hotels that have completed/activated profiles (and used tokens / are marked active) are returned to admin and guest portals (no more 'No Hotels Available'), including ensuring hotel records exist in storage and are included in the public/admin listing APIs.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Align the backend canister Candid API with the frontend’s `ExtendedBackendInterface` so the runtime errors like `extendedActor.updateHotelProfile is not a function` and other missing-method errors cannot occur.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement `updateHotelProfile(name, location, address, mapLink, whatsapp, email)` in `backend/main.mo` with the exact parameter order expected by the frontend, and persist the updated fields into the caller’s hotel record.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Fix/restore room APIs to match frontend signatures: implement `getRooms(filters: RoomQuery)`, `createRoom(roomNumber, roomType, pricePerNight, currency, pictures)`, and `updateRoom(roomId, roomNumber, roomType, pricePerNight, currency, pictures)` in `backend/main.mo`, ensuring they work for activated hotels.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Ensure an activated hotel can create rooms and appear in admin/guest hotel lists even if their hotel profile record did not previously exist, by initializing and maintaining a consistent hotel record in storage (including a maintained list of room IDs).",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Implement/restore `getHotels()` in `backend/main.mo` to return the hotel list used by both admin visibility tools and guest browsing, and ensure hotels marked active are returned so the guest Browse Hotels page does not show “No Hotels Available” incorrectly.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Implement admin hotel management APIs required by the existing admin UI: `setHotelActiveStatus(hotelId, active)` and `setHotelSubscriptionStatus(hotelId, status)` in `backend/main.mo`, enforcing admin-only access.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Restore/implement any additional backend methods referenced by the frontend hooks so authentication/role checks and invite token flow do not error at runtime (at minimum: `getCallerUserRole`, `isCallerAdmin`, `makeMeAdmin`, `validateInviteToken`).",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "Add a focused regression check (manual or automated where applicable) using the existing `frontend/REGRESSION_CHECKLIST.md` flow to verify: hotel profile saving, room create/update with photos, guest browse hotel visibility, and admin hotel visibility toggles.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Implement and enable standard booking flow for guests: select hotel/room, choose booking dates, number of rooms, and number of guests, then create a booking record (currently UI shows booking is unavailable/coming soon).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "Add booking management across portals: bookings created by guests must appear in the Hotel account and Admin portal; Hotel can confirm a booking; booking status must update to Confirmed consistently in Guest, Hotel, and Admin views.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "Implement flexible hotel-managed payment methods: do not hardcode country/payment providers; allow each hotel to add/edit its own payment methods (e.g., GoPay/DANA/ShopeePay/bank transfer/etc.) and expose them for guest checkout choice (online vs pay-at-hotel). Admin does not manage payment methods.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "Fix/enable Hotel Portal fields that are currently not active: allow hotel to enter/save hotel email and add/manage payment methods from the hotel account without breaking existing features.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "Implement backend booking APIs required by the frontend `ExtendedBackendInterface`: `createBooking(hotelId, roomId, checkIn, checkOut, guests, currency)`, `getBookings(filters)`, and `updateBookingStatus(bookingId, newStatus)` with correct authorization so bookings work for guest, hotel, and admin portals.",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "Extend the booking data model to support 'number of rooms' (room quantity) and ensure `totalPrice` is computed based on nights × pricePerNight × roomQuantity (and persisted on the booking record).",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-24",
      "summary": "Enable flexible hotel-managed payment methods: implement backend APIs `addPaymentMethod(name, details)` and `removePaymentMethod(index)` for activated hotels, persist them to the hotel profile, and expose them through existing hotel profile queries (e.g., `getHotels`, `getCallerHotelProfile`, `getHotelProfile`).",
      "reqIds": [
        "REQ-18"
      ],
      "status": "pending"
    },
    {
      "id": "AR-25",
      "summary": "Implement backend booking APIs in `backend/main.mo` so the frontend no longer shows the runtime error \"Booking functionality not yet available in backend\" when the user clicks \"Confirm Booking\".",
      "reqIds": [
        "REQ-23"
      ],
      "status": "pending"
    },
    {
      "id": "AR-26",
      "summary": "Align the booking data model between frontend and backend: extend backend `BookingRequest` to include `roomsCount` and persist it for each booking, matching `frontend/src/types/extended-backend.ts` `BookingRequest.roomsCount`.",
      "reqIds": [
        "REQ-24"
      ],
      "status": "pending"
    },
    {
      "id": "AR-27",
      "summary": "Implement `createBooking(hotelId, roomId, checkIn, checkOut, guests, roomsCount, currency)` in `backend/main.mo` with correct validation and authorization so authenticated guests can create bookings for an active hotel’s room.",
      "reqIds": [
        "REQ-25"
      ],
      "status": "pending"
    },
    {
      "id": "AR-28",
      "summary": "Implement `getBookings(filters: BookingQuery)` in `backend/main.mo` to support guest, hotel, and admin booking visibility as expected by the existing frontend tables (Guest: own bookings; Hotel: bookings for caller’s hotel; Admin: cross-hotel).",
      "reqIds": [
        "REQ-26"
      ],
      "status": "pending"
    },
    {
      "id": "AR-29",
      "summary": "Implement `updateBookingStatus(bookingId, newStatus)` in `backend/main.mo` with authorization and status transition support for the existing Hotel Bookings and Admin Bookings UIs.",
      "reqIds": [
        "REQ-27"
      ],
      "status": "pending"
    },
    {
      "id": "AR-30",
      "summary": "Add booking cancellation feature across guest and hotel portals: show a Cancel action in Guest 'My Bookings' for Pending bookings only; show a Cancel action in Hotel bookings list for Pending and Confirmed bookings; persist cancellation via backend `updateBookingStatus` (or equivalent) to set status to `Cancelled`, enforce authorization rules (guest cannot cancel Confirmed), and keep Cancelled bookings visible in history/reporting views.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-31",
      "summary": "Implement booking cancellation rules in the backend booking status update flow so that:\n- A guest can cancel their own booking only when the booking status is `pendingTransfer`.\n- A hotel can cancel bookings for its own hotel when the booking status is `pendingTransfer` or `booked`.\n- All canceled bookings remain retrievable via `getBookings` and continue to appear in all booking history views.\nCancellation must be persisted by setting booking status to `canceled` (matching the existing `BookingStatus.canceled` used by the frontend).",
      "reqIds": [
        "REQ-28"
      ],
      "status": "pending"
    },
    {
      "id": "AR-34",
      "summary": "Add a focused regression verification pass limited to booking flows to ensure the new cancel feature does not break existing booking functionality and that no unrelated features are modified.",
      "reqIds": [
        "REQ-31"
      ],
      "status": "pending"
    },
    {
      "id": "AR-35",
      "summary": "Clean up legacy/ghost room photos still appearing in Guest/Admin hotel browsing (but not in Hotel account) by removing the old room photo assets/records from the backend so they no longer show anywhere (user reports ~5 old room photos).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-36",
      "summary": "Clean up legacy/undeletable payment method entries in the backend (e.g., lingering 'GOPAY' text and old email stored in payment methods) so they can be removed and do not reappear; keep the Add Payment Method feature so hotels can add new methods themselves, and ensure email is only stored/displayed via the Hotel Profile email field (not duplicated in payment methods).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-37",
      "summary": "Add an admin-only backend maintenance API to permanently remove legacy/stale hotel data that is still visible in Guest/Admin browsing but should no longer appear anywhere, without changing normal product behavior for other hotels.",
      "reqIds": [
        "REQ-32"
      ],
      "status": "pending"
    },
    {
      "id": "AR-38",
      "summary": "When the admin maintenance API is run for the affected hotel, delete the legacy room photo data (reported ~5 old room photos) so those images no longer appear in Guest Browse Hotels, Admin hotel browsing, or the Hotel Detail room cards.",
      "reqIds": [
        "REQ-33"
      ],
      "status": "pending"
    },
    {
      "id": "AR-39",
      "summary": "When the admin maintenance API is run for the affected hotel, remove the legacy payment method entries that cannot be deleted (including the 'GOPAY' entry and the old email stored as a payment method), and ensure they do not reappear.",
      "reqIds": [
        "REQ-34"
      ],
      "status": "pending"
    },
    {
      "id": "AR-40",
      "summary": "Ensure the hotel email is only represented via the hotel profile contact email field and not duplicated/derived into payment methods during reads or writes, so guests/admins do not see email displayed as a payment method.",
      "reqIds": [
        "REQ-35"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix backend regression: restore room create/update APIs so hotel room data (including photo URLs) can be saved",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}