{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Hotel booking app: room data uploaded by hotel must be saved and visible on hotel dashboard and guest views (currently only visible to admin).",
  "architectural_notes": [
    "Room listings uploaded by hotel should be automatically published/visible to hotel and guests (no admin-only visibility), with role-based access ensuring correct read/write permissions."
  ],
  "known_issues": [
    "Bug/regression: hotel-uploaded room data appears in admin account but does not appear in hotel or guest accounts."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-frontend-hotel-dashboard-and-guest-hotel-detail-views-reliably-refresh-room-data-after-create-update-and-do-not-accidentally-query-rooms-with-an-invalid-anonymous-hotelid-keep-all-user-facing-copy-in-english",
      "title": "Ensure frontend hotel dashboard and guest hotel detail views reliably refresh room data after create/update and do not accidentally query rooms with an invalid/anonymous hotelId. Keep all user-facing copy in English.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-focused-regression-verification-pass-for-the-room-upload-visibility-flow-covering-hotel-owner-upload-guest-browsing-and-post-reload-persistence-and-document-any-steps-needed-to-reproduce-verify-the-fix-in-the-existing-regression-checklist",
      "title": "Add a focused regression verification pass for the room upload/visibility flow covering hotel owner upload, guest browsing, and post-reload persistence, and document any steps needed to reproduce/verify the fix in the existing regression checklist.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix/build room data upload flow so hotel-uploaded room listings are saved and visible to both hotel dashboard and guest account (not only admin).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Fix backend room create/update and room listing behavior so that rooms uploaded by a hotel account are persisted under the correct hotel principal and are retrievable by (a) the same hotel account in the hotel dashboard and (b) guests browsing the hotel detail page (not only admins). Ensure the room read path uses a single source of truth (roomsMap/hotelsMap) and that role-based filtering does not accidentally exclude the hotel owner or guests for the uploaded hotel.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix backend hotel/room visibility rules so guest-facing hotel discovery and room browsing do not hide hotels/rooms in a way that breaks booking discovery. Align the rules with the required behavior: once a hotel uploads rooms, guests must be able to see that hotel’s rooms for booking in guest views.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix room upload persistence and visibility for hotel and guest accounts",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}