{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build and fix the validated hotel account experience so that hotel users see a Hotel Dashboard and Hotel Area menu matching the provided screenshot, including hotel data management and room photo uploads.",
  "architectural_notes": [
    "Implement role/permission + validation-gated UI routing so validated hotel accounts land on Hotel Dashboard and see Hotel Area navigation."
  ],
  "known_issues": [
    "Validated hotel accounts currently do not show the Hotel Dashboard and Hotel Area features as expected."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-make-the-hotel-area-navigation-entry-visible-for-validated-hotel-accounts-matching-the-screenshot-behavior-when-logged-in-as-an-activated-hotel-user-show-the-hotel-area-link-in-the-top-navigation-and-allow-navigation-to-hotel",
      "title": "Make the Hotel Area navigation entry visible for validated hotel accounts, matching the screenshot behavior: when logged in as an activated hotel user, show the 'Hotel Area' link in the top navigation and allow navigation to /hotel.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-hotel-management-dashboard-ui-for-hotel-accounts-matches-the-second-uploaded-screenshot-header-hotel-management-with-description-text-and-a-tabbed-interface-with-tabs-in-this-order-profile-rooms-payments-bookings-record-stays-subscription-rooms-tab-must-support-adding-rooms-and-uploading-room-photos",
      "title": "Ensure the Hotel Management dashboard UI for hotel accounts matches the second uploaded screenshot: header 'Hotel Management' with description text and a tabbed interface with tabs in this order: Profile, Rooms, Payments, Bookings, Record Stays, Subscription; Rooms tab must support adding rooms and uploading room photos.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-after-successful-hotel-validation-activation-via-invite-token-consumption-automatically-refresh-relevant-cached-queries-and-redirect-the-user-into-the-hotel-management-dashboard-so-the-change-is-immediately-visible-without-manual-refresh",
      "title": "After successful hotel validation/activation via invite token consumption, automatically refresh relevant cached queries and redirect the user into the Hotel Management dashboard so the change is immediately visible without manual refresh.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "After hotel account validation, show Hotel Dashboard + Hotel Area menu exactly like screenshot (tabs: Profile, Rooms, Payments, Bookings, Record Stays, Subscription) including hotel data entry and room photo upload.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Fix the hotel activation flow so that after an invite token is consumed, the authenticated hotel account becomes 'activated' and can load its hotel profile successfully (so the app treats the account as an activated hotel and shows the Hotel Management dashboard).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure the backend exposes and/or restores all API methods that the current frontend uses for hotel activation and hotel-area gating (including role/admin checks and caller hotel profile retrieval), and that these methods do not trap for valid callers in expected flows.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Restore validated hotel account: show Hotel Area menu + Hotel Management dashboard (match screenshot)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}